{
    "COMM_ST": {
        "COMM_ST 101-1": {
            "2023 Fall": {
                "course_rating": {
                    "average": 3.62,
                    "student_count": 21
                },
                "student_opinions": {
                    "0": "I am so confused. The professor talks  a lot about his personal research interests but I have no idea why this class relates to communication.",
                    "1": "This course was great. The grading was good as well. In addition, there wasn’t any over the top assignments, and the teacher was also super understanding!",
                    "2": "Taking this course with Prof. Schwoch was for my major requirement, but it was not as boring as I thought it may have been. While dealing in Communication, Schwoch focused a lot on climate change and environmental sustainability as he is really passionate about these subjects. He is extremely nice, communicates assignments, topics, information, and other important issues really well, and is very flexible when it comes to assignment due dates or other issues. Sometimes, we would go over the content in class much faster than expected, so he would release us fairly early, which was always nice to have time to study or make my way to another part of campus. One issue was discussion as there was not as much discussion as I had hoped, but that was more of the class not feeling up for discussion or participation rather than Prof. Schwoch himself. Overall, a great course and I recommend taking it with him!",
                    "3": "The professor rambled for two hours about environmental science topics and showed media (videos, images, etc) occasionally that was very disconnected from each other. He was very passionate I just did not see the connection to the course.",
                    "4": "Very easy class. While Professor Schwoch is a nice person, the class was so disorganized as the lectures had nothing to do with homework assignments.",
                    "5": "It's a good intro to communication course.",
                    "6": "This class is really easy, there's like 4 assignments, no final, no midterm. I think its an okay class, I liked the professsor because he was super sweet but I had a really difficult time paying attention during the class and I still got a really good grade.",
                    "7": "Kinda boring, but nice professor",
                    "8": "This course was very boring and hard to stay engaged in. It definitely does not have to be as long as it is. The professor was very sweet and nice but was hard to follow. Very easy assignments, though.",
                    "9": "This course consisted of a lot of lectures and videos about various topics such as climate change, technological advancement, and environmental issues. However, it did not feel like a cohesive course and the writing assignments we had were never relevant to the content we covered either. It's unfortunate because the professor was clearly very passionate about the topic, but I don't think he piqued any of our interests in the content.",
                    "10": "Very all over the place – I could never tell what he was going to talk about (not in a good way).  I don't know if this is the best introduction course to the communication studies major",
                    "11": "This course was quite interesting. Lots of focus on climate change and diversity, equity, and inclusion issues in our world.",
                    "12": "The course was very easy, and there were only a few assignments the whole quarter with no quizzes or exams. The lecture material does not really have anything to do with the assignments because they're mostly on climate change while the assignments do not require any of the material from class.",
                    "13": "This class was an easy A. There's not much work, so most people just do homework for other classes.",
                    "14": "This course did not feel valuable to my major. I think the topics covered could be interesting if they had some kind of structure, but it just felt like watching a lecture each week with little cross connection between them and no real discussion."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 21,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 12,
                    "Sophomores": 6,
                    "Juniors": 3,
                    "Seniors": 0
                }
            },
            "2024 Winter": {
                "course_rating": {
                    "average": 2.84,
                    "student_count": 25
                },
                "student_opinions": {
                    "0": "This class was pretty boring. A lot of discussion about environmental issues and random topics. I wouldn't recommend it if you aren't a comm studies major, since it's required for the program specifically.",
                    "1": "The most important parts of this course is when they brought in other faculty members in the school of comms to talk about their classes and research. I also found value when they brought in the advisors to hear about our thoughts regarding the class.",
                    "2": "This professor talks a lot about the environment. He's a very sweet guy and did things like give us a day off in week 6 because he knows how stressful it can be. You can get by this class without doing any preparation or taking notes because the homework/slides don't relate to the assignments. But still, I would try to be more engaged in class discussions. Since this is an intro course, it's important to see if anything piques your interest because maybe you will want to work in that sort of thing after (with a comm_st degree). That's how I approached this class. Very low stakes, but if anything is noteworthy, recognize it!",
                    "3": "Importance of time management",
                    "4": "This class is honestly a bit confusing because it doesn't really teach you much about communications. But it's really easy. There's like 2 assignments per month, and they're pretty easily graded. You don't really have to go to class. The professor is enthusiastic about what he teaches.",
                    "5": "This course is relatively boring, but Professor Schwoch is very knowledgeable about topics relating to Climate Change and the Global Environment. The workload is super light–just three short papers.",
                    "6": "I was looking forward to an introduction to communication studies after declaring my major, but became extremely disappointed after taking this class.  Professor Schwoch is very sweet and understanding, but the class was extremely disorganized and I felt like I had barely learned anything relevant to the communication studies field. I appreciated that it is not a work heavy class, but none of the assignments we did were related to the course material.",
                    "7": "This course was really easy while taking other difficult courses because I would learn a lot in class but it did not require a lot of outside of class time for work.",
                    "8": "Extremely easy class that is mildly interesting and is taught by an enthusiastic professor.  The main issue I have is that this is literally the most random class ever and this essential equates to just Professor Schwoch yapping for an hour about a random mildly interesting topic while students sit and browse the internet.  The issue is not the class itself as I did learn some interesting content but rather the fact that none of it is connected and made me have 0 clue on what my future major of Communication Studies entails.  Overall it was an enjoyable class that was very low stress and a free A (so as a student it has been my favorite NU class) but ultimately played 0 role in the purpose of my education.",
                    "9": "Was generally very confused with this course, did not learn much.",
                    "10": "My favorite part of the class was having guest speakers come in. Also having the advisors come in was super helpful and made choosing classes easier as I knew more about the requirements and what classes were coming in the future.",
                    "11": "Professor Schwoch is a great and really smart professor, especially when talking about climate change. However, we didn't have any class that properly talked about communication itself. We had a couple of guest speakers talking about opportunities within Comm St department and that was nice. However, we had 3 assignments (one celebrity biography, one list of e–waste we have at Northwestern, and a diversity essay) and two discussion questions to be graded that had no direct connection to what we saw in class/our interests.",
                    "12": "I am under the knowledge that this course will look different starting fall of 2024 but this class was quite unorganized. The professor is super nice and sweet but his main focus was on Climate Change and it was a kinda hard to stay engaged when I wasn't really interested in the topic.",
                    "13": "There’s not a lot of structure and engagement in the course.",
                    "14": "He barely spoke about communications. Not sure what the point of this class is, especially since it's a major requirement",
                    "15": "Professor Shwoch was the nicest and extremely knowledgeable in climate control communications. I liked this course, but felt it was not a good fit for the required introduction to the major.",
                    "16": "The class material falls far from the actual topic. The professor talks about the environment that is very far from communications. I only went to this class 3 times. The work can be done without attending the lecture.",
                    "17": "I enjoyed getting a good understanding of some concepts about the history of communication; however, I joined the class assuming it would be more contemporary, which was somewhat disappointing.",
                    "18": "I was disappointed when I realized what the course really was. I was hoping to learn about communications as a major and walked away learning that the human race is destroying the enviroment (which I already knew)."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 24,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 18,
                    "Sophomores": 5,
                    "Juniors": 2,
                    "Seniors": 0
                }
            }
        },
        "COMM_ST 101-2": {
            "2024 Winter": {
                "course_rating": {
                    "average": 4.62,
                    "student_count": 42
                },
                "student_opinions": {
                    "0": "I was honestly pretty bored most days",
                    "1": "very nice class, good combination of lecture and workshops",
                    "2": "In comparison to 101–1 this is much much better, however, as SoC continues to adapt its core classes, I think it would be beneficial to combine these two classes and possibly teach very simple things but otherwise leave the theories etc to research methods.",
                    "3": "Good class – professors were great, very understanding, class was engaging. Like all other SoC classes, very managable. Good grading",
                    "4": "I really liked how the professors were so supportive and understanding of everyone. Class contents not too difficult either, which was nice.",
                    "5": "I find the aspect of suedos–cience very interesting",
                    "6": "I think it was very evident how much the professors were interested in the topics being taught, and I enjoyed how encouraging they were for the class to participate.",
                    "7": "This class is very interesting! You have the opportunity to learn information you never thought you would learn in SoC",
                    "8": "This was the next course in the Comm Studies 101 sequence, but I felt like it wasn't related to the previous course at all. We focused on communication science concepts, like misinformation, but the information didn't feel very centralized and related, so every class we would just look at a new topic without continuation from the previous. Professor Scherr and Professor Walter were both very passionate and engaging, and always tried to get the whole class involved. Their examples and slides were also insightful and connected to the real world, but not always applicable.",
                    "9": "This course is a really basic introductory course for communication studies. Really light workload, and the final project requires us to verify a scientific claim with the concepts we learned about humanity research throughout the quarter. The two professors are really nice.",
                    "10": "This course had a good dynamic of in class workshops and out of class readings. Most important to me was collaborating with the other students during class.",
                    "11": "This class was very interesting and the professors were very passionate about the topic. This made it more engaging for me.",
                    "12": "It was a great class.",
                    "13": "I was honestly pretty bored most days",
                    "14": "very nice class, good combination of lecture and workshops",
                    "15": "In comparison to 101–1 this is much much better, however, as SoC continues to adapt its core classes, I think it would be beneficial to combine these two classes and possibly teach very simple things but otherwise leave the theories etc to research methods.",
                    "16": "Good class – professors were great, very understanding, class was engaging. Like all other SoC classes, very managable. Good grading",
                    "17": "I really liked how the professors were so supportive and understanding of everyone. Class contents not too difficult either, which was nice.",
                    "18": "I find the aspect of suedos–cience very interesting",
                    "19": "I think it was very evident how much the professors were interested in the topics being taught, and I enjoyed how encouraging they were for the class to participate.",
                    "20": "This class is very interesting! You have the opportunity to learn information you never thought you would learn in SoC",
                    "21": "This was the next course in the Comm Studies 101 sequence, but I felt like it wasn't related to the previous course at all. We focused on communication science concepts, like misinformation, but the information didn't feel very centralized and related, so every class we would just look at a new topic without continuation from the previous. Professor Scherr and Professor Walter were both very passionate and engaging, and always tried to get the whole class involved. Their examples and slides were also insightful and connected to the real world, but not always applicable.",
                    "22": "This course is a really basic introductory course for communication studies. Really light workload, and the final project requires us to verify a scientific claim with the concepts we learned about humanity research throughout the quarter. The two professors are really nice.",
                    "23": "This course had a good dynamic of in class workshops and out of class readings. Most important to me was collaborating with the other students during class.",
                    "24": "This class was very interesting and the professors were very passionate about the topic. This made it more engaging for me.",
                    "25": "It was a great class."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 42,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 16,
                    "Sophomores": 20,
                    "Juniors": 6,
                    "Seniors": 0
                }
            },
            "2024 Spring": {
                "course_rating": {
                    "average": 5.0,
                    "student_count": 9
                },
                "student_opinions": {
                    "0": "This course was more work than I expected it to be for a 101 class; however, the course content was very interesting. There was about 1,000 words of writing every week. Our class discussions were always great.",
                    "1": "This is a fantastic class! The course material is extremely engaging, covering four units around doping, injury, data, and gear. I found myself being really excited to talk to my friends and family about what I was learning. Being a student–athlete myself, it was great to have a class around the nuances to sport. <br><br>This class is really what you make out of it. I know some people didn't take it very seriously, but I did, and it was very exhausting. For example, in the first week, the professor assigns around 6 homework assignments per class, which can range from short news articles to hour–long documentaries or hour–long podcast episodes. Additionally, you are expected to write a 500–word write–up that summarizes the main points of all the homework assignments, which makes it difficult to skim/skip. The TA was also a careful grader, so I always felt like I needed to submit my best work. In the second week, you do a quarterly project that's 1000–1500 words. We only had from Tuesday end of class to Thursday beginning of class to complete it, so it was stressful. If it was a group project, it was manageable, but two of them were individual, which was not manageable. You repeat this process for four units of the class, and the final project is a fun interview.<br><br>Take this class if you're interested in the topic! Get ready to do a lot of work, but also get ready to learn a lot. As the quarter goes on, you'll also have a better idea of how to manage the workload and where to do less/more. The professor also responds promptly to emails and cares about student input.",
                    "2": "This is a very good course if you are interested in sports and Professor Fouche is a great lecturer and extremely knowledgable in his field.  This was a very enjoyable class.",
                    "3": "I was very pleased with the focus of this course. The course covered a large range of concepts and I only wish we had more time to dive even deeper into the topics.",
                    "4": "This course is a lot of fun. It was filled with a lot of people who played sports and were able to offer their own lived experience. The professor is incredibly knowledgeable when it comes to sports and offers fun topics to discuss. The reading can be a bit much at times but it is all worth it. For a required course, this is a really good one!",
                    "5": "The topic itself was very interesting but we were allowed very little time to prepare for almost all assignments––we were give 2 days to write 1000+ word essays and prep for a presentation. The professor, however,  was very passionate and allowed  for fruitful discussion.",
                    "6": "The only reason I took this class was because its a major requirement and I still do not understand why this is an introduction class for communication courses. This class was literally about discussing sports and how technologcial advancements affected sports in general. We explored topics such as doping, impact of technology on sports officiating, and athletes athletes using external devices in able–bodied competitions. It was so hard to participate in class discussion as I had no background knowledge nor play any sports. Out of 4 courses I took this quarter, this course had the most work to complete. You need to complete 4 quarterly project – 2 group and 2 individual. No matter you work alone or individually, you only had TWO DAYS to complete the report and prepare for 3–5 minutes presentation, which was A LOT. The required word count for the project was 1000–1500 for the first group project and 2 individual projects and 1500–2000 for the 2nd group project. Tuesdays of our project week was supposed to be a work period, according to the syllabus, but we never got time to work on so I would dedicate my whole Tuesday and Wednesday night completing works for this class. He announced the team and explained the topics 20 minutes before the class ended which made the situation even more stressful.  On the weeks you are off from quarterly project, you have reading responses to complete and the readings were a lot too. The content itself were not that tough, but the amount of reading was just a lot. UNLESS YOU ARE SUPER INTERESTED IN SPORTS, I DON'T RECOMMEND TAKING THIS CLASS. WAIT FOR ANOTHER TOPIC.",
                    "7": "I liked this course a lot and it helped me learn and look at new perspectives",
                    "8": "I would summarize this course by describing it as a class that examines the moral bounds of athletes relying on external sources to boost their performance. How these enhancements are received by the audience/viewers plays a large role in the aforementioned moral bounds."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 9,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 6,
                    "Sophomores": 2,
                    "Juniors": 1,
                    "Seniors": 0
                }
            }
        },
        "COMM_ST 102-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.105806451612904,
                    "student_count": 124
                },
                "student_opinions": {
                    "0": "pretty easy standard public speaking class – speeches once or twice a week, some on the fly, some with a prepared outline<br><br>Lenient grading and very manageable workload were nice, required attendance even on non–speech days is a bit annoying considering that lectures aren't really that helpful unless you're a comms major who needs to know random theory of speaking bug facts",
                    "1": "Recommend taking this class if you need to present/ speak for your career. I took the class just cuz.  I feel like it provided knowledge I can apply to future research presentations. A little annoying at times though with the required outlines before each speech.",
                    "2": "This is a decent class with not a lot of grade pressure. The class doesn't take too much time, but speeches require preparation &amp; the final 2 speeches of the quarter require some time investment if you want to walk away with a good grade. Overall pretty chill class. Andy is an understanding professor who gives extra credit opportunities. Many speeches throughout the quarter which you get lots of feedback from. Would have enjoyed the course more if the feedback we received was more specific rather than just a rubric and a standard justification comment. Class can sometimes feel boring especially with 2 hours.",
                    "3": "It was a great course with Prof.  Acosta.",
                    "4": "Stricter rules and grading from what I heard from other instructors teaching public speaking. Very strict attendance (skip more than two courses and drop a half letter grade), easy grading with lots of extra credit (if you want an A you will get it)",
                    "5": "I think the repetition of speeches and getting in front of the class was very important for building my comfort level. Also, we got a lot of freedom in the speeches we wrote which made it very relaxing and fun.",
                    "6": "There were about 4 high stakes speeches that required more time outside of class to do research/write. Recommend taking if you feel iffy about speaking in public. Class provides a good space to step outside your comfort zone and practice to become a better, more confident speaker.",
                    "7": "I thought it was a great course. It was fun to learn about other students through the material they spoke about. You also grow immensely as a public speaker.",
                    "8": "class is not very challenging – just be conidient and listen to teacher feedback – have to do many speeches though",
                    "9": "I am very glad I took public speaking. I feel like everyone can learn something from this class and it doesn't require too much time from your weekly schedule, both of which were very important to me.",
                    "10": "This course does an excellent job of keeping you engaged throughout the class. The in–class exercises provide a safe space where you can practice speaking without any pressure. Overall, the class is relaxed and as long as you complete your outlines and practice your speeches properly, you should have no issue with this class.",
                    "11": "It was a helpful course for public speaking",
                    "12": "Skylar is a really responsible instructor and cares about her students. It's a pretty fun and light class and also helps you with getting public speaking skills.",
                    "13": "This class doesn’t require a lot of outside preparation but the lectures are long and engaging.",
                    "14": "As far as requirements go, it is pretty bearable. You get in, learn what needs to be learnt about public speaking– a lot of it common sense but still some useful tidbits in there.",
                    "15": "It was exactly what I expected it to be. There was maybe a little more outside reading than I thought, but it went how anyone would expect a public speaking class to go.",
                    "16": "I learned a lot about how to analyze others' speeches, not so much about how to write my own speech.  It was really helpful that we got a lot of practice speaking in front of others, but I would have appreciated more coverage on how to actually write longer speeches.",
                    "17": "Pretty chill class, but Skylar was definitely one of the more strict teachers compared to others' experiences that I had heard before. Speeches won't necessarily be a free A. However, it is still definitely relatively easy to get a good grade in the class.",
                    "18": "I thought that the course was okay. I think that it definitely could've been better. Two hours twice a week where you had to actively participate in class became a little exhausting and annoying for some weeks. It was nice that we were given a break though. I would honestly say that if you don't have to take the class it probably wouldn't help you a lot in expanding your public speaking abilities unless you really put in the work to improve your skills.",
                    "19": "A very helpful course with really nice and unique ways to help us practice our speaking. Skylar is very kind grader and considerate – definitely recommend!",
                    "20": "Fatima was a great instructor. I learned more than I expected and I'm glad to have improved over the course of the quarter.",
                    "21": "Four speeches make up 70% of the grade, a short Intro speech in Week 1, a Informative Speech in Week 6, an online Mediated Speech in Week 9, and a final Persuasive Speech on finals week.  The other 30% is Peer Reviews and Class Participation.<br>Fatima is a great professor, able to make class really engaging and interesting.",
                    "22": "Fatima is a great instructor! Really appreciated that she didn't make us do impromptu speech",
                    "23": "The course isn’t the best but you can learn a lot from it.",
                    "24": "good class",
                    "25": "The course was a nice break from typical engineering courses",
                    "26": "Good class for learning speech strategies, I was already very confident in my speech, and it still helped me patch a few holes. For people who have difficulty speaking, the notes given during class really do make for an outline for great presentations. If any of you shy people are reading this, don't be afraid to get up there and speak for your cause! Overall though, very low maintenance class for the good  information and practice you get out",
                    "27": "This class is a toss–up. I've heard some teachers just let students give a speech every lecture to get them used to speaking, but my teacher would lecture about different types of speeches and how to effectively give them. This may be helpful for some, but I believe a more casual daily speech format would be more helpful, especially for McCormick students who take this for the graduation requirement.",
                    "28": "ok class, just had to show up and then do some speeched.",
                    "29": "Somewhat cool class. Prof Gaw is super nice",
                    "30": "I took this course as a School of Communication requirement, but I thought it was pretty enjoyable. You get a chance to interact and collaborate with other students, which is insightful especially when they are upperclassmen. Also, I found it to be pretty open what kind of topics you want to do, which allowed for a lot of freedom and versatility for speeches. The course doesn't really require a lot of work except for when you need to finish your speech, but even then, it's up to you how much effort you really want to put in. It's definitely a good opportunity to explore subjects you enjoy and share them with others in the process.",
                    "31": "Very fun and engaging to the students as well as the professor. Very relaxing class with fun activities to naturally improve public speaking skills.",
                    "32": "I liked this course",
                    "33": "Good class. Very light workload with Amelia. She is a very easy grader and a good instructor. Highly recommend.",
                    "34": "I really improved on my public speaking skills like talking slower and maintaining eye–contact",
                    "35": "Very reasonable class. Sometimes I put more time into the class when we had upcoming speeches. We had five speeches throughout the quarter. Amelia is super friendly and willing to answer questions.",
                    "36": "Really chill class. The instructor was great and gave really good feedback. This class was just a really good chance to practice speaking in front of people and it really helped me",
                    "37": "This class is very helpful. Sometimes it can be a little silly but overall I felt as though my public speaking got a lot better through taking this course and I pay attention to how I talk in spaces a lot more now. Also, the time commitment was very manageable. You have to practice and research a little, but it was work that I usually enjoyed doing.",
                    "38": "Very good class and helpful towards speeches.",
                    "39": "Really well done in terms of promoting a safe space for a bunch of awkward engineers to try public speaking. By the end we were all goofy and friends and comfortable together and that had a lot to do with Behailu! He is such a sweetheart and put so so so much time and effort into our classes and giving us very specific feedback. He was amazing and dedicated to this class",
                    "40": "this course is good for working on your public speaking skills especially if you are like me and you have performance anxiety. you learn mostly through doing the actual speeches––the lectures aren't always that helpful. i think there are some things in the lectures that are good to note but they are not that interesting to be honest. however, the course is very simple and not hard at all because the instructors want you to focus on improving your skills rather than stressing over grades.  i think i did improve in my speaking skills over the quarter and it helped me to be more confident.",
                    "41": "This was the best class of my quarter and the Professor Behailu is one of the best teachers and mentors in this college. He brings life lessons to this class everyday and I was thrilled to see what he would say each day. Very smooth process for this class and easy to learn as well. TAKE THIS CLASS with Professor Behailu Mihirete.",
                    "42": "Professor Mihirete is an amazing professor and puts in a lot of effort into making the lectures interesting. He is extremely accommodating and helpful. Highly recommend taking the class with him!",
                    "43": "It was an easy class, didn't exactly learn much. Professor was extremely sweet, but the content of the class other than giving the actual speeches was unnecessary and boring.",
                    "44": "I really, really enjoyed this class! It was a nice break to have in my schedule as an engineering student. Plus, I really enjoyed having Behailu as a professor. He's honestly one of the most kind and understanding instructors I've met thus far at Northwestern. He really wants to just be there for his students and he's willing to make accommodations if you simply reach out to him. I really wish more professors were like him since I felt like he really was there for me throughout the quarter even though I wasn't a comms student and rarely saw him outside of class. I really appreciate him and if you have the chance, go take a class with him!",
                    "45": "Very rewarding class to take. The instructor was very helpful in finding my strengths and honing my weaknesses.",
                    "46": "Behailu is an amazing instructor, who cares so much about all the students in the class. He provides detailed feedback after each speech, and his end goal is really to see everyone improve.",
                    "47": "The course is great. There's just a few speeches per quarter, plus some tiny online homework that's not a big deal. You learn a lot without having to stress about anything.",
                    "48": "Learned a lot of interesting things about speaking and got to practice a lot in low stakes.",
                    "49": "This class and Behaliu were great. Learned a lot and did a lot of low–pressure speeches that helped me develop my skills.",
                    "50": "If you have to or want to take Public Speaking, you HAVE to take it with Prof. Mihirete!!! Prof is not only an amazing professor, but an experienced with many credentials. Lectures are very relaxed and you learn the parts of each speech that you will perform and other skills. On the first day, he asked if we were nervous with being speakers and you could tell by our first speeches that we are all pretty nervous, but by the end of the quarter we all did our final assignment in a BREEZE! some of us went over time because we were that excited about our topics.<br><br>In this course, there were 4 speeches that you will do during the quarter. An introduction of yourself (2–5 mins), a TedTalk Analysis (Watch a TedTalk, talk about it ), an informative speech, and a persuasive speech. There are also assignments on Inquizitive, which is an online platform where you learn the material from lecture but in a game/trivia format. There were only a few Inquizitive assignments that were mandatory and the rest were optional. All speeches ranged from 3–6 minutes and trust me time goes fast! Watch the clock!<br><br>For the informative and persuasive speech, a class day or two will be cancelled in order to prepare for your speech, if you need any additional research or choose to make a Powerpoint. <br><br>Prof will also have you come up to the class in the beginning of each week, so you can tell the class what you did over the weekend (Approx. 1 min). This was an easy thing to do for points and help you increase your public speaking skills. Prof also has you choose a random prompt from a bucket and you have 5 minutes to prepare so it is sort of impromptu, this was fun and no one was worried!!<br><br>He is very quick to respond to emails and will hold individual office hours to help construct and/or practice your speech. He also gives amazing feedback on every speech that you do, and will even send resources that align with your interests or will help you for future speeches. Prof Mihirete is not a strict grader as he emphasizes that no one is perfect or is a professional speaker. As long as you follow the guidelines and complete the inquizitives on time, you are guaranteed an A+.<br><br>He is also very aware that this class may not be a priority since it was majority Engineering students, but he ensured that if you dedicate enough time to the course you will pass. Some days, he will even shorten lecture so that we have time to study for other classes and midterms! HES AMAZING!<br><br>TAKE THIS COURSE WITH PROF MIHIRETE!!!!!!!!!!!!!!!",
                    "51": "Walker puts a lot of effort into making the class a fun learning environment and the various types of speeches help break down the important elements of public speaking. I really enjoyed listening to other people’s speeches and seeing different styles that I could incorporate in mine. Reflections were useful for some introspection and seeing how I’ve improved.",
                    "52": "I learned a lot about how to perform public speaking. How to vary voice, how to persuade, how to inform, how to do impromptu. Learn by doing and we did a lot of speech practice.",
                    "53": "This course was awesome! Such a fun and helpful course. It was helpful in getting you out of your comfort zone and be able to organize/prepare for speeches.",
                    "54": "I enjoyed it a lot and learned a lot of things. As a McCormick student, it was great to have a chance to work on different skills, and this class is a great way to gain more confidence in public speaking, learn different strategies to make your argument better,  and to speak more effectively, and just having fun and experimenting.",
                    "55": "Getting feedback before actually giving my speech really helped me know that I was on the right track and gave me more confidence in my speech",
                    "56": "I loved this class!! Brewer was super nice and made the class a very welcoming experience. It’s fun to learn more about your peers through their speeches and the lectures prepare you well to give your own. I also appreciate the amount of feedback we got and how willing to help they were. Also the snacks on speech days we amazing. Definitely take this class.",
                    "57": "I really loved this course! Walker made it a very practical class by focusing on the content and delivery of speeches throughout the quarter rather than making it a boring rhetorical analysis high school English–type class. We learned about different types of speeches: impromptu, informative, ceremonial, and persuasive. And we wrote and delivered each speech to the class—noticeably getting better with each one. We were allowed to choose topics that we were interested in, making for very fun and passionate speeches from each class member. We got to know more about each other while also getting better at every aspect of public speaking—content, voice, hand gestures, and more. I found that my actual public speaking skills and confidence have improved immensely, and I am so glad I took this class. Walker is very understanding and helpful with feedback, so I'd highly recommend running ideas by them before speech days. They created a very fun, warm, and welcoming environment even at 9 am, and the group activities were engaging. HIGHLY RECOMMEND THIS CLASS WITH WALKER!!!",
                    "58": "The class felt like a safe environment to present our ideas, despite the nervousness of having to speak in front of other people.",
                    "59": "We had a speech every other week, but no papers which was nice.  I really enjoyed each class they were a little longer than other sections which got out earlier, but Walker was really engaging and fun to learn from. I will say I felt like we got graded a little harsher than the other sections as well. I",
                    "60": "This was a great and easy course to help you speak in front of people and build confidence as you speak publicly.",
                    "61": "I enjoyed the course and Walker clearly had a passion and a lot of knowledge towards topics involving communication and public speaking. Often the lectures could drag on and were sometimes irrelevant and boring, and I wish Walker was a little more consistent/clear about how the speeches were graded, but overall I think they are a good professor who is passion about the class and teaching.",
                    "62": "I really enjoyed this course even though I was nervous for it at the start. I feel like I developed my speaking skills and confidence a lot throughout the quarter and Professor Brewer was fantastic. They really created a supportive environment and made the class fun to come to everyday.",
                    "63": "This course, specifically with Prof. Brewer was very well thought out and focused on the core of public speaking. Using real life examples of speeches along with ample practice time was particularly effective in making sure coursework was effectively utilized. Overall, the course was very well done and I would recommend taking the course with Prof. Brewer if given the opportunity.",
                    "64": "Great class! Prof. Brewer is great! I learned so much and definitely improved my public speaking. Community was built in course and much was learned in speech content as well. Very chill and you get to talk about things important to you! would reccomend!",
                    "65": "This class was amazing. Walker really focused on making this class applicable to real life and made sure that we were learning real skills. I loved all the group work and fun presentation slides because they made sure I stayed engaged. Walker was also great at taking feedback and editing the course as needed to make sure we were learning and hitting everything we needed to.",
                    "66": "The aspects that were most important to me were to be more confident, to articulate my thoughts better and learn how much public speaking is a valuable skill.",
                    "67": "Super fun and engaging. It wasn’t overwhelming with the workload, and I feel I improved greatly as a public speaker.",
                    "68": "TAKE THIS CLASS EVEN IF ITS NOT A REQUIREMENT FOR YOU!! Kimberly was the greatest instructor I ever had! She is empathetic and puts much effort into making the course better. The course has 5 graded speeches spread throughout the quarter (intro, informational, elevator pitch, impromptu, demonstrative) and a small learning journal about each speech. You also fill out 2 anonymous peer evaluation forms each speaking day about your classmates' speeches. I felt this course was very chill to go through and interesting considering many (if not all) skills we learned are useful outside class, especially in professional settings. With time, the whole class bonded and we ended the quarter having many friendships too. You have a few classes that are also optional office hours to plan your speech and ask questions. We had 2 workshops with guest speakers that taught us very important skills too.  The only thing is that missing a class means having a considerable loss of content. Presence on speaking days (even if you're not presenting) is mandatory. I would recommend this class to anyone.  If you're an international student (like me) and are worried about your English skills being harshly evaluated, don't worry! Everyone is very understanding and so is the instructor, who is more focused on your oratory/delivery than checking your grammar all the time.",
                    "69": "This was a great course! Professor Kimberly Pusateri is super kind and a great professor. The class is low–stress and we often do fun speaking activities in groups during lectures. We deliver five different speeches throughout the quarter, which make up the majority of our grade. The speeches aren't particularly hard but they do require planning and practicing beforehand. I would say an A is definitely achievable in this class if you put in a good effort.",
                    "70": "This class is just kind of boring and I wish I did not have to take it. I really did not like how oddly specific the requirements were for each speech and it was just not very interesting. I think it would probably be more interesting for people who like doing presentation/speaking though.",
                    "71": "This class was so much fun! I'm an engineering major so I did have to take this class to fulfil my degree requirements, however, I'm so glad I took it. If you have a quarter where you're taking 3 difficult/intense classes, I'd suggest having this be your 4th as its not time consuming and serves as a nice break compared to your other classes.",
                    "72": "This class was easy, fun, and Kimberly is the best! From this class, there were different aspects of public speaking that I didn't realize were important. This class also made me better at thinking on my feet.",
                    "73": "I learned about how to write and deliver different types of speeches, and the peer and instructor feedback was very helpful. The entire class was really encouraging and class activities were fun and helped with building confidence for our speeches.",
                    "74": "Kimberly is a delight to work with. Many varied speech types were practiced and it was a delight to attend class.",
                    "75": "No readings or homework besides preparing for the speeches. Class time was not too stressful and practicing without being graded was enjoyable.",
                    "76": "Kimberly was such a good professor. I would highly recommend taking the class with her if you have the opportunity.  Additionally,  the lack of extraneous work outside of class made the learning experience fun, yet also maintained the requisite immersion.",
                    "77": "This course was really valuable because it teaches you how to structure and deliver a good speech. In this version of the class, there were 5 speeches that you had time to prepare for in advance. Each speech required a good amount of work to prepare for so that you meet all the requirements, but the course is not very time consuming.",
                    "78": "Overall great course. Workload varied by week. Grade mostly depends on 5 speeches through the quarter, with minimal out–of–class work besides preparation and reflection of the speeches.",
                    "79": "It was a solid course that allowed me to practice my public speaking skills. I felt that I was steadily improving throughout the quarter.",
                    "80": "Pretty fun and super easy course. We had about 5 structured speeches. We also had to present randomly sometimes.",
                    "81": "fun class !",
                    "82": "The professor is super nice and the course is mainly focused on doing stuff in class and almost no homework. Really recommend",
                    "83": "One of the most fun classes I've taken so far. Kalia is a great professor. She made the class really enjoyable and I'm glad I got to take the class with her. It was great to practice public speaking and really get more familiar and ready to do impromptu speeches without having to stress out about a grade.",
                    "84": "This class is very learning based, so there are a lot of participation and speech points. Overall, fun class if you like speaking in front of the class and with peers.",
                    "85": "This class wasn't difficult. It was extremely helpful to have more public speaking opportunities so that I could see what areas I could improve on and what I am currently doing well in. Kalia did a great job of making the class engaging.",
                    "86": "This was a very straightforward course, and helped gain more exposure to public speaking.",
                    "87": "Kalia was a wonderful teacher in this class, and despite being constrained in curriculum/presentation she really made this interesting. She was extremely understanding and willing to work with me on conflicts, which I had a lot of this quarter (can't really vouch for other teachers unfortunately). If you are stressing about this course there's really no reason to worry! It's over fast and is helpful if you are nervous about public speaking. The stakes are really low and you just have to show up and put effort in to get 100%.",
                    "88": "It did what it set out to do",
                    "89": "This course is not difficult to get an A, but you will get however much you put into it. Trying out different speaking tactics in a safe environment is pretty rare these days, I believe this sets up everyone well to have the confidence to elaborate on your beliefs in front of other people."
                },
                "school_demographics": {
                    "Weinberg": 11,
                    "McCormick": 88,
                    "Medill": 1,
                    "Comm": 19,
                    "SESP": 3,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 23,
                    "Sophomores": 18,
                    "Juniors": 35,
                    "Seniors": 47
                }
            },
            "2024 Winter": {
                "course_rating": {
                    "average": 5.241583333333334,
                    "student_count": 120
                },
                "student_opinions": {
                    "0": "Its a requirement for McCormick but you can definitely learn a lot.",
                    "1": "Behailu is a very solid guy who grades generously and has some interesting stories to tell. You will give 5 speeches in this class which should take a maximum of 1–2 hours of prep each.",
                    "2": "This class was okay. I took it because I had a bad registration time and it's definitely annoying. The speeches were fun to compile and nervewracking at times, but the professor was incredibly malleable and kind and encouraged us to learn from our mistakes. The professor made this class a lot more bearable because he is very knowledgable and wants you to learn.  The two hour lectures were definitely unnecessary though,  could be shortened by a lot.",
                    "3": "Awesome",
                    "4": "Professor Behailu made this course very rhetoric focused because that is his study. I learned a good amount in this class and became a more confident public speaker. We started doing in class activities more in the second half of the class and they were helpful so my only criticism is that the lectures before that were long and not always that helpful.",
                    "5": "Boring but required class, not a ton of work as long as you go to class and put a level of effort into your writing",
                    "6": "Prof. Mihirete was very engaging, and the structure of the class was nicely paced. It was fun presenting a different variety of speeches. Everyone in class is very chill since most of us are engineers, so it is a nice environment to relax and learn in.",
                    "7": "Really recommend taking public speaking with this professor. 5 speeches where you get feedback from professor after each one that are useful to improve on the next.",
                    "8": "I found the course to be quite chill and not stressful at all, to be honest, I enjoyed most of the speech assignments as I was able to do some research on a topic I found interesting, which motivated me to design a good speech and practice it. I really wish for there to be more in class activities and less lectures as these helped me to think about constructing arguments and delivering speeches on the fly. The work was the perfect amount with 5 speeches.",
                    "9": "Speeches take a lot of time to write",
                    "10": "Professor Mihirete is a great professor. As an engineering student, I was not looking forward to this class. However, Professor Mihirete understood that the majority of his students were taking this class as a requirement to graduate and did his best to accommodate this. I recommend you take this class with Professor Mihirete!",
                    "11": "Fine course, necessary for all McCormick students, would recommend taking with Behailu as he's an engaging lecturer and grades based on your performance relative to yourself, no one else. Textbook is not necessary.",
                    "12": "Solid, helped the public speaking aspect a lot for me.",
                    "13": "I really liked the structure of the class– how we were able to learn how the speech is supposed to be then were able to take in on our selves and do our own speech",
                    "14": "Great course for practicing public speaking.",
                    "15": "I enjoyed being able to learn in such an open environment. Everyone was free to speak their mind through activities, debates, and speeches.",
                    "16": "TAKE PUBLIC SPEAKING WITH CHLOE!!!  I enjoyed her class so much. She is very communicative, flexible, chill, and supportive. She would give us very very detailed feedback and help us to improve our grade and quality of work. She WANTS YOU TO BE SUCCESSFUL in this class, so please use her as a resource. She also provides variety of opportunity for extra credit activities, which I enjoyed a lot. Her lecture is very well organized and fun!!",
                    "17": "This class really helped me to better understand how to properly execute a speech. I liked how the class was structured as it was very organized. There are four speeches throughout the quarter. Chloe was very responsive to email and always willing to meet to run through your speech to provide feedback prior to speech day.",
                    "18": "I really enjoyed this section of public speaking. Chloe was a great teacher and really dissected public speaking. I felt as though I learned a lot of things about public speaking that seem so simple, but are actually super important. Even though I really didn't want to take this class, I enjoyed it a lot more than I thought I would because of Chloe's teaching style and just how laid back this class was. Obviously, effort must be made to do well on your speeches, but I really enjoyed this class.",
                    "19": "This was a great course! The speech prompts and in–class debates were very enjoyable.",
                    "20": "This class was more take–home work than I expected. However, I think the grading was not too harsh. The most important thing for me was that I was able to get more comfortable speaking to a larger audience.",
                    "21": "Speaking in front of thee class is daunting but very helpful and useful for other situations. the short activities, outside of the speeches themselves, were helpful to get used to being front and center.",
                    "22": "It was a good opportunity to practice public speaking, although admittedly the topics of the speeches were not all helpful for speaking that I will be doing in the future.",
                    "23": "I thought that this was a good course. Given that I had to take it as a graduation requirement for McCormick, I was happy that this course was very chill and not a source of stress at all. Chloe was extremely nice and willing to help outside of class",
                    "24": "Very enjoyable class. The activities are fun but also helpful. Profesor always helped me with tips and recommendations, and by the time the course ended I improve my public speech skill a lot.",
                    "25": "This class gives you a good baseline for public speaking, and most importantly, experience synthesizing and giving speeches from draft to actual speak performance.",
                    "26": "I think that Floor focused well on the aspects of the course most important to me and my classmates. It helped the most with just comfort and confidence in speech giving and I think that is what everyone was looking for.",
                    "27": "I enjoyed the course very much and enjoyed the class activities. While the course isn't hard and it's an easy A, there is quite a bit of work so make sure you turn in your work on time.",
                    "28": "I feel like the course was very well structured and did not feel like a \"stressor\" – the point–based grading (where you could skip a few assignments and still get an A) allowed definitely made me focus more on what I was going to do rather than what grade I'd get. Floor managed the classroom and content as well and was well–organized. The class definitely turned out to be more enjoyable than I expected, which was a plus.",
                    "29": "Floor was an excellent teacher and we were constantly exposed to public speaking to get better. I never liked public speaking, but this course made it actually fun.",
                    "30": "I loved this class! You should definitely take it with Floor she is so awesome and relaxed about grades. She really cares about her students progress and success and felt very invested in all of our success. I would highly recommend",
                    "31": "Floor was very chill to take this class with. Wouldn't mind taking public speaking again.",
                    "32": "Floor is great. I learned so much about public speaking and the amount of work was super manageable. The class was fun.",
                    "33": "Floor does an amazing job in prioritizing practice which us really the only thing that leads to improvement. Highly recommend you take w her",
                    "34": "This course gives you a lot of practice  for future public speaking. You give 3 speeches on three units, and there are fun activities that get you out of your confort zone, but improve your nerves and speaking skills.  So overall, you will improve your public speaking skills in a really chill environment.",
                    "35": "This class was awesome, mostly because Floor is just an amazing teacher. She always has really helpful feedback and the class has a super flexible grading system that allows you to learn in a way that best works for you",
                    "36": "Professor Goldsmith is the best! The class is engaging and fun and you learn a ton. There are a few writing assignments and three speeches throughout the quarter.",
                    "37": "I think the progression of the course was important because we started with a shorter speech and ended with a long speech once we developed the knowledge and skills to do so. Experience in front of the class every day was also really essential in our growth. Overall, the class had a really good structure for student development.",
                    "38": "Everyone should be required to take this course!<br><br>Most people aren't naturally gifted at public speaking and that's okay. Like any skill, you can get better with practice. Public speaking is uncomfortable, and you'll likely feel uncomfortable at certain points in this class. But in the end, you'll come out stronger and more confident.",
                    "39": "Goldsmith is a really good professor to take public speaking with. I was honestly dreading this class before taking it but he has made the classroom a comfortable environment. His format was three speeches, three papers, and one out of class observation. The workload isn't bad at all, the only thing was that our final speeches are during finals week and I know some of my comms friends who were done before reading week. But there is plenty of time to get things done with Goldsmith and he is always after student's best interests.",
                    "40": "Ok class. Very low time commitment and easy, but not the most interesting or useful honestly. I wish we did more in–class speaking activities and less readings",
                    "41": "We got weekly impromptu chances to apply our learnings in a low stakes class setting. Professor was helpful with feedback too",
                    "42": "The class was straightforward. Three speeches varying in length and style. The in class exercises were helpful and I definitely felt that my public speaking skills improved. Adam was great– really understanding and helpful.",
                    "43": "We gave three large speeches throughout the quarter and had a couple of simple writing assignments. The professor is very helpful, and as long as you put effort into your speeches they will go well.",
                    "44": "This course was interesting and I enjoyed the group activities, however, I do not feel as I'm walking away with any improved ability to speak in public.",
                    "45": "This class challenged me to become a better public speaker and made me improve a lot throughout the quarter.",
                    "46": "I was not excited about this class but Eva made it very fun and her teaching techniques greatly helped me improve my public speaking skills. The way Eva taught it was great and much better than the horror stories I had heard from my friends.",
                    "47": "Very easy, but interesting class. Professor Celem clearly cared a lot about the subject, but sometimes she cared a little bit too much. She was very strict about no technology and at one point berated the class for so long because some people didn't label their files the way she wanted them to (even though she never told us to name them a specific way). The work load was very manageable and it is not hard to get an A as long as you show effort.",
                    "48": "I obviously didn't have high hopes for this class, I just had to take it for my major requirement. Eva is honestly fine, but she's really strict with deadlines and kind of aggressive. She blamed us for not submitting assignments on time when she didn't correctly update Canvas. Also, it's pretty ironic that she teaches a public speaking class but she just reads off the slides word for word and kept stuttering while talking to us. Speech wise, you do three speeches, but they're honestly pretty easy. She seems to be a pretty easy grader too.",
                    "49": "It is a required public speaking class. Nothing special. The professor can be very passive–agressive at times. But, with effort, you can definitely finish with an A.",
                    "50": "Thought it was a good course but extremely demanding and homework was a lot for a public speaking course I thought. Although this was true I thought the teacher ultimately helped us understand and better our public speaking skills",
                    "51": "This class was pretty easy. There are so many points at the end of the quarter it is easy to get an A. The enjoyment level definitely depends on the instructor  you have.",
                    "52": "This is a great class to take! As someone with very limited public speaking experience, by the end of the quarter, I felt like I had not only improved, but also figured out some things that I could change in the future to keep advancing. In class, we participated in group activities, which made for an easier environment to speak in front of peers. Would recommend.",
                    "53": "It's a relatively simple distro that shouldn't really eat up much of your time. Professor Andrews makes the environment very casual and comfortable for those who might feel awkward talking otherwise..",
                    "54": "Professor Andrews is super chill (seemingly more than a lot of other public speaking professors).  The course mainly consists of doing 3 speeches: a kind of warmup one, an informative one, and a persuasive one. There's no impromptu speeches and the grading is very lenient and low stakes, so its a very nice environment to just practice writing and delivering speeches. Lectures aren't really that helpful and mainly consist of stuff you probably learned in high school and the occasional speaking exercise. Regardless though Professor Andrews did a really good job structuring the class, speeches, and the vibe to push people ever so slightly out of their comfort zone while still making the class a very safe space (coming from someone who is an anxious public speaker).",
                    "55": "I really liked this class. It was extremely low pressure, and I was pretty much just practicing my speech giving abilities without being scared of getting a bad grade. There were learning journals after each speech and only three speeches all quarter (a maximum of seven minutes in length for the longest one). Great class to take if you are taking other difficult classes as you're pretty much guaranteed an A if you show up and do your speeches.",
                    "56": "SUMMARY<br>Straightforward and easy speech class which gives you some opportunities to practice speaking. Take it with Emily Andrews if possible—she is great!<br><br>PROS<br>– Emily Andrews is the best! She is very understanding and a pretty engaging instructor.<br>– Grading is pretty lenient. You're practically guaranteed an A if you put some effort into your speeches, read the rubric and complete all assignments. Easy class overall.<br>– Good coverage of different speaking styles. You get to give different kinds of speeches: personal, informative and persuasive.<br><br>CONS<br>– If you've ever learnt public speaking or had a speech class, this course doesn't teach you much you don't already know. I liked having the opportunity to speak in various settings, but wished I had more opportunities to challenge myself (like with an impromptu speech).",
                    "57": "emily was an amazing teacher, she really made the class enjoyable and not to stressfull!",
                    "58": "Emily is the best professor to take this class with. She is so fair and understanding. 3 speeches throughout the quarter and you have to submit an outline before and a learning journal (reflection) after, then a speech evaluation of a speaker event. The class was also actually engaging since she would do activities with us throughout the quarter to get us more comfortable speaking in non–speech settings",
                    "59": "Best professor we could’ve had! Very kind and created a fun atmosphere.",
                    "60": "It's a required course, let's face it. But what you put into the class is really what you get out. If you follow the content, are intentional with practicing your speeches, it's a great opportunity to become a better public speaker or at least equip you with the skills to becoming one. Emily was a fantastic instructor, super fun but also very reasonable with the content and workload.",
                    "61": "Super easy and helpful class. Very little time spent outside of class but varies on how much you want to prepare for speeches. A couple of short and very manageable writing assignments. Good to take along with some more challenging classes. Emily was a great professor, very flexible and thought used time wisely in class. Absolutely should not be a 2–hour class twice a week. An hour and 20 mins would be more than enough and I think that needs to be changed.",
                    "62": "Emily is fantastic! This class was not too much work (3 speeches, 3 learning journals, and a speech analysis) and it was structured in a way to give you plenty of time to work on assignments.  Emily does a good job creating a low–stress environment which helps if you are not a big fan of public speaking. It is a very manageable class and allows you to get more comfortable talking in front of a group of people.",
                    "63": "I really enjoyed this class. I was able to practice my public speaking skills in a low stakes, supportive environment. It was a relatively easy class which is super nice given how hard other classes are",
                    "64": "If you need to take this class for McCormick, take it with Emily! She is very understanding and made the class as pain free as possible. We had three speeches throughout the quarter and one reflection for each speech, so the workload is super manageable. She helped create a low–stakes, stress free environment, and an A is basically guaranteed as long as you do the work.",
                    "65": "Your grade is composed of ~5 speeches throughout the quarter, a lot of participation/attendance, and a speech analysis paper<br>On a rotating basis, as you go through each speech, homework consists of submitting your speech ideas, giving feedback on peers' ideas, submitting your outline, or preparing for your speech. <br><br>This class was great! Kevin was a really great professor––would recommend. He gave great feedback and graded super fairly. He made it super easy to do well in the class and actually helped you improve. It's definitely a class where you get out what you put in––if you want to improve a lot you can, or you can just do the bare minimum to get an A.",
                    "66": "Very fun and easy class. One of the best professors ive had, always giving really good feedback while not diminishing my confidence in public speaking. The speeches and in class activities were very fun and relaxing, even if you don't like public speaking.",
                    "67": "This class was a very positive learning environment that taught us skills we would need on the daily and professionally to be good communicators. It was a very happy, fun class, and the professor fostered a great learning environment that was educational, friendly, accepting, and welcoming.",
                    "68": "This course was both enjoyable and helpful in teaching real–world skills. Prof. Ackermann is very enthusiastic and provides good feedback. There are three big speeches to prepare for which actually take time to write but it isn't difficult work and always about a topic of your choice.",
                    "69": "This is a very chill class. Not a lot of out of class work and it is a lot of learn by doing. Kevin is a good teacher and creates a fun and welcoming environment.",
                    "70": "This course was amazing! Kevin was the best professor and as long as you put in effort you will do well. There are five speeches, the introductory speech, informative speech, impromptu speech, persuasive speech, and final speech. They all naturally build on each other and are not stressful at all. I learned a lot and become so much more comfortable speaking in front of people!",
                    "71": "Take this class with Professor Ackermann. Although this is a McCormick requirement, but I definitely learned a lot through the quarter.",
                    "72": "Kevin's style of teaching ensured we were all given a sufficient amount of attention to ensure we learned.",
                    "73": "I loveee Kevin. He takes feedback from students on what we're struggling with and directly implements that into his curriculum. He also would play Laufey and Lana during class lol. We did 4 /5 speeches throughout the quarter and I think it really helped me improve my speaking skills. Overall, the workload is super super manageable and we get to choose whatever topics we want for the speeches which made the class fun.",
                    "74": "Super easy and chill course where you learn the art of public speaking by making 4 major speeches and a few other practices. Took less than one hour of practice a week outside of class and was great. Take with Kevin if you can, super chill and great learning environment.",
                    "75": "It was pretty easy. Low work requirement outside of class. Kevin Ackermann was a good professor.",
                    "76": "It is a fabulous course that helped me learn a lot without spending too much time or stressing about my grade.",
                    "77": "Enjoyable class! Would recommend taking it with Camille if you can.",
                    "78": "Professor Saucier was amazing and the class was super fun! Easy class to knock out the McCormick requirement, and you definitely get out what you put into this course. Even if you get super nervous when public speaking like me, it's still great.",
                    "79": "I enjoyed this course",
                    "80": "This was a really great class. Not too much work which I appreciated, but enough to help me learn and grow as a public speaker. Camille was an awesome professor.",
                    "81": "This was a really great course. Professor Saucier made all of the classes, fun, engaging, and humorous. I enjoyed the relatively low course load (the main work was preparing for and presenting 3 speeches). The more important aspect was the class itself. Everyone improved significantly with public speaking which was great to see and the process was enjoyable. Rather than having to sit through lectures for the entire class, there were usually discussions or activities in groups of 2 or 3 that followed these lectures. These activities were fun and allowed us to get to know other students in the class. Overall, if you have to take this class or want to take public speaking, I highly recommend taking it with Professor Saucier.",
                    "82": "Camille is genuinely one of the best professors I've had at Northwestern. Would recommend taking any class with her.",
                    "83": "I really enjoyed this course and definitely feel that I gained valuable skills that can easily be applied to many other aspects in life. Working on how I present myself to others and reflecting on it throughout the course has made me a more confident speaker.",
                    "84": "We had three main speeches about 5 or 6 minutes and other assignments such as self reflections and peer reviews. Overall, the course is designed to help you succeed so as long as you put some effort into preparing your speech you should be fine.",
                    "85": "I really enjoyed this class. Professor Saucier is the BEST. She really cares about each student and makes the class fun and engaging. I love the discussions and I think my favorite speeech was the explain how something works –– this is very applicable for the engineering majors.",
                    "86": "My presentation skills were greatly improved and the instructor was very helpful in guiding me through it.",
                    "87": "This class was very good. We had 3 speeches that allowed us to go over a range of topics. The material was very helpful and Camille does a fantastic job at going through things. The class is well organized and the syllabus makes sense. I feel like part of the class is focused on practical tips that help us with our career and other aspects relevant to us."
                },
                "school_demographics": {
                    "Weinberg": 9,
                    "McCormick": 83,
                    "Medill": 0,
                    "Comm": 26,
                    "SESP": 2,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 20,
                    "Sophomores": 37,
                    "Juniors": 28,
                    "Seniors": 35
                }
            },
            "2024 Spring": {
                "course_rating": {
                    "average": 5.245744680851064,
                    "student_count": 94
                },
                "student_opinions": {
                    "0": "this class is great! I would recommend taking it with a grad student.  I was in the only section with an actual professor, and although he was great, we had to give 9 8–minute speeches every week, including 2 debates, which was definitely more time consuming than I thought it would be for a 102 class.  But, I do feel like I have learned a lot about speaking",
                    "1": "This class is pretty easy. Professor is a little hard of a grader but is really encouraging to help you get better at speaking. The work outside of the class is not hard at all took me like 2 hours to create outline and practice speech and gets easier at end after practice.",
                    "2": "I actually ended up enjoying this course more than I thought I would! While the speeches may seem daunting at first, if you put effort into them, you will see yourself improve in public speaking! I really enjoyed the personalized feedback; that really helped me see areas for improvement and what I was doing well.",
                    "3": "You have to write and give an 8 minute speech every week in this class except for the first week. Fitzmier is  nice and not a harsh grader. Although it’s nerve wracking to give a speech at the beginning, you get used to it over time. Fitzmier does not lecture on how to give speeches ever. The way you learn is through hearing what comments he has to say about other people’s speeches and through the private comments he gives you. Basically every class is people giving speeches one after the other. The hardest part of this class was probably writing the speeches every week just because some topic were hard to write about.",
                    "4": "Good class and helpful. Pretty easy and low commitment.",
                    "5": "I was very disappointed with this course. As a communications major I was excited for public speaking as an opportunity to learn how to be a confident speaker. However, this course did not give me the opportunity to grow as a speaker. I do not believe this course was helpful and I was disappointed by the \"uselessness\" of this course.",
                    "6": "Skylar is a good teacher. There aren’t too many assignments for this class. You have 4 speeches, and she gives you a lot of time to prep for them. Classes sometimes felt a bit long and boring though, just because it was 2 hours from 4–6 pm.",
                    "7": "I took the course thinking that I would hate it since I was so scared of speaking in front of an audience, but I ended up loving the course. There were so many practice opportunities in class, which prepared me for my speeches. Professor Clark was very understanding and nice, and wanted us to do our best. I learned a lot and improved my public speaking skills a lot.",
                    "8": "Public speaking, no notes",
                    "9": "I found the course about as I would expect. I appreciated the instruction",
                    "10": "It was straightforward, and didn't require an unnecessary amount of time outside of the classroom to achieve what was expected. Actually pretty useful as far as helping to get better at/become more comfortable with public speaking.",
                    "11": "This course was pretty chill. If you do the readings, it makes it easier to succeed at giving better speeches. You are expected to participate a lot in class, which means speaking a little bit in front of everyone, but it's not a big deal and everyone has to do it.",
                    "12": "This was a fine course to take. It was not very difficult and did not require much work. I think it is an easy way to fill the communications requirement for engineers.",
                    "13": "Andy was a great professor! This class is a lot of work especially outside of class but as long as you put the effort in it should be an easy class. A lot of Andy's grading structure revolves around effort/improvement which made a lot of even the \"high stake\" speeches relaxing and enjoyable.",
                    "14": "A little bit of busy work, but honestly really worth it. Professor Acosta is passionate about public speaking and highly dedicated to this class. He really cares about students and help them do well. As a past public speaker,  I felt like this course helped me pick up public speaking again, and is really really worth it. Many speeches, but fun class.",
                    "15": "Not much time commitment. Easy A. Really helps you practice and improve your public speaking skills, so I was very satisfied.",
                    "16": "Andy is a great professor and really cares about his students. This class is a decent amount of work, needing to make outlines each week and do speaker evaluations, but if you put in basic effort anyone should get an A. Most of the speeches are \"low–stakes\" meaning you get full credit just for showing up and speaking, while a couple are \"high–stakes\" meaning you should prepare more and are actually graded on speaking skills",
                    "17": "This class was great, the flipped classroom structure made it much more fun since we got to hear more speeches in class. Professor Acosta is amazing, wish he could teach this class for everyone – made us very motivated and excited about the subject. Very empathetic and caring professor.",
                    "18": "Professor Acosta made the class highly enjoyable. He made the class really intimate and spent time giving one–on–one attention during class. The class is essentially constructed in a way that you will get to know others in the classroom. He is an enthusiastic professor. The criticism he gives is really helpful too. I was really impressed by how enjoyable and fun he made the class. I was honestly dreading taking this class because of how bad my anxiety is. But he made it really fun and welcoming. Some of the prompts were funny and had other students and the professor himself laughing aloud.",
                    "19": "Very calm and supportive class",
                    "20": "This course is actually pretty useful. It can be annoying, but this course definitely made me a better speaker. I had a lot of speech anxiety near the beginning, but as I spoke more and got more comfortable with my classmates, the pre–speech stress started getting better. Also, the grading is pretty relaxed, so the course ended up being pretty stress–free. Lastly, professor Andy (Acosta) is amazing!",
                    "21": "This course is great for people wanting to go into consulting or other careers with project deliverables! Definitely will use the skills I learned/strengthened in my future.",
                    "22": "It was very good. We covered the basics; eye contact, visuals, hand gestures, what not to say, etc",
                    "23": "Walker is an excellent instructor who taught me a lot about the different speech genres in ten weeks. He's soooo good at using various materials and organizing games that significantly deepen our understanding about speech. I came with no prior knowledge about English public speaking, but he made me conquer the fear of speech as an international student and made the class so fun. <br>Love it!",
                    "24": "Great class and loved the professor. I took the class for engineering and really enjoyed it. It is pretty chill class. 4 speeches in the entire quarter. To prepare for the speech it was maybe like an 1 or less to prep. The professor is great and makes the class really engaging especially when it was at 9am. They also give a lot of feedback on the speeches and wants you to do well in the class. Does not require any extra work just the 4 speeches and going to class.<br>Easy, fun, chill class. <br>highly recommend taking it with Walker.",
                    "25": "Take this class with Walker! Walker is clearly passionate about teaching this course and their method of teaching public speaking is engaging and fun. They are also very approachable and provide great and detailed feedback for every speech assignment. If you want to try public speaking or improve your speech skills, this is the class to take!",
                    "26": "Great course. The prof was amazing and super enthusiastic. They were very chill and lenient as long as you communicated. Learned a decent amount about different types of public speaking, and the most important parts of each. Highly recommend taking with the prof, overall a great time.",
                    "27": "Best section IMO",
                    "28": "This class was a great class and I'm glad I took it with Walker. They're an amazing instructor who really understands their students. This course really helped me improve my public speaking skills in a stress–free environment. I was not nervous while I was in Walker's class and it really showed in how well I was able to conduct my speeches. Overall I really think this course made me a better speaker in front of groups and if you have the option to take a public speaking class, take it with Walker.",
                    "29": "Super good class takend with Walker.  Got to hear all interesting speech topics from your classmates",
                    "30": "Walker was such a wonderful public speaking teacher! I came into the class really anxious and nervous about public speaking. It was something I dreaded doing and I honestly was dreading taking this class, but Walker made the topic a lot of fun. Despite being one of the only underclassmen in the class, Walker made the environment really welcoming and comfortable. I really enjoyed learning about the different types of speeches and getting practice writing and presenting speeches. Walker also gave really helpful feedback and advice that I'll definitely use when doing public speaking in the future.",
                    "31": "Walker is fantastic, but an engineering required public speaking course is going to be miserable no matter how you construe it. You have to take this though, and Walker really tries their best to minimize the pain involved. Note that you will have more speeches than most other sections, but grading is not horrible and walker will help you develop.",
                    "32": "I enjoyed the class, it definitely helped me to grow in my confidence in public speaking and to learn about the different kinds of public speaking/speeches and how to approach each one",
                    "33": "A nice class overall, you grow to like the other people in your class since it's not a huge group of people. I enjoyed a lot of the speaking activities in groups during classtime, but sometimes the different assignments and activities get a bit tedious to do, and I also think this is because my professor was known to give more assignments compared to other professors of this same class.",
                    "34": "Amazing class. Will be tough but you actually get better at speaking in public. Also, a great way to meet people since everyone is a lot more vulnerable since they are constantly speaking infront of the class and nervous.",
                    "35": "wasn't expecting it to be a lot of work outside class, but overall the workload is manageable and its pretty easy to get an A because of all of the opportunities for points,. If you don't get nervous speaking in front of people and follow the rubric, you will be fine",
                    "36": "not a huge time commitment except practicing the week of the speech (we only had two major ones with Eva). overall an enjoyable class but felt very long especially when she was lecturing. very low pressure and fun environment",
                    "37": "This class was exactly what I expected, writing and giving speeches. The environment of the class was very friendly and made it easy to build confidence. I wish the choice of speech topics was more flexible because it made writing some of the speeches very boring.",
                    "38": "Prof. Celem was such a wonderful professor! Super compassionate and understanding of everyone's situations. The classes were fun and creative, we got to work on preparation for mini speeches and improv, as well as a couple of soft days by sharing a skill, which everyone really enjoyed. Definitely do rehearse your speeches and use the strategies that your professor provides because they are most definitely helpful. Practice doesn't make perfect when it comes to public speaking, but it does make you a better prepared speaker in general.",
                    "39": "The class is good, but I wanted to have fun in it and just entertain my crowd instead of doing public speaking. While this lead to me engaging with the class and doing quite well with keeping the audience engaged, my grade in this class suffered. Take the class with as many friends as possible, as it becomes exponentially more fun the more friends you have.",
                    "40": "It was a good, useful course! I felt much more confident with public speaking after because of how big of an improvement I saw in myself. Public speaking is such an important skill to have and I'm glad that I was able to take this class.",
                    "41": "I took this class as a senior looking to develop my communication skills before graduating, and I'd highly recommend it to anyone! Super light workload, blend of impromptu in–class speaking activities and prepared speeches, and overall a supportive environment to get lots of practice with public speaking.",
                    "42": "Ms Mortenson was pretty good. Her politics showed at times but she occasionally worked to balance it out and be reasonable. Otherwise she is very understanding and chill. The class was definitely a unique experience in general, as an engineer, but required more work than I was expecting to write and prepare for my speeches",
                    "43": "Chloe is a great teacher. We did so many fun in–class activities that helped really helped build confidence and speaking skills.  We had four speeches, all across various topics. Chloe provides great feedback and is really committed to helping improve her students' speaking skills.",
                    "44": "I mean this course is required, but it was pretty good. Chloe was a good teacher and made it a lot better than I was expecting.",
                    "45": "I LOVED this class! It was a very good environment with not a lot of people, and with the activities that were in class, it made it an environment where it felt so normal to feel nervous taking risks and stepping out of your comfort zone. There was a great balance of slides/lectures, speeches and activities.",
                    "46": "I genuinely gained a lot from this class, despite its low commitment level. I definitely noticed how much more confident I became as a speaker throughout the quarter. Chloe was fantastic! She was understanding, made the class both fun and informative, and was always willing to help students. I was quite nervous during my first speech, but her comforting body language and active listening made me feel more confident and supported. I highly recommend taking this class with Chloe!",
                    "47": "This course had fun activities, and the speeches were useful and applicable to your career. I also enjoyed the debates.",
                    "48": "The structure of her class was made to be applicable into multiple career fields.",
                    "49": "Really positive, professor Mortenson was great and reduced my nerves massively with the speeches",
                    "50": "I loved my public speaking class! Chloe is a very relatable and understanding instructor, and she was always prompt in giving feedback and grades. I felt like I got to know my classmates better because we did so many speaking activities in class together (some that were lighthearted and others that were a bit more serious). There were four speeches, and each of them helped me to practice something different. The first one was about someone I admired, which was easier to speak about. The second one was a persuasive speech, so I had to be more strategic about how I conveyed my message. The third one was more informative, which helped me to simplify my concept into an easy–to–understand framework. The four one was the also persuasive because we had to argue the perspective that the class disagreed with. There wasn't a lot of homework, but whenever a speech outline (like a short paper) was due, there was a ton of homework. And then before a speech, there was a ton of homework because you need to constantly practice. The rubric was super thorough and as long as you hit every point, you get an A. Also, she gave so many extra credit opportunities, yay! As the quarter goes on, I did find a way to write my speech faster and practice my speech with less pressure to do it perfectly. I definitely feel more confident with speeches now, knowing how pacing, eye contact, audience, body language, and all that stuff is important to consider.",
                    "51": "This was a great class! Chloe was so amazing and super chill. I liked how you did not need to have the most amazing public speaking skills to do well – everyone is at different levels but Chloe will guide you to become better at public speaking. The class was structured into 4 speeches ranging from someone you admire to explaining how something works. Chances are you are taking this because it is required, but I do think there is a lot of value in learning these skills. I really enjoyed the class structure too – Mondays are for lectures/in–class activities and Wednesdays are for speeches. Chloe also gave great feedback and made sure our speeches were on topic. Overall, this was a low–stress course with a great instructor and taught me so much!",
                    "52": "Take it with Emily!!! She really cares about her students and wants to make this class as painless as possible.",
                    "53": "This class was 4 speeches, Emily graded very fairly and relatively leniently. This is all speech based with no homework other than the speeches and short reflections after your speech. Overall, a relatively easy A and low commitment class. A lot of the time the class was less than 2 hours which was nice.",
                    "54": "LOVED THIS CLASS AND PROF. EMILY! TAKE IT WITH HER! She makes the class fun and very chill. There's no better space to practice public speaking.",
                    "55": "can do good on speeches if you just put in a bit of effort",
                    "56": "The course was fine",
                    "57": "DEFINITELY take this class with Nash if you can!!!!!! He is the BEST!!!! As a PHD student, he really understands us. His efforts made this class sooo engaging and effective. I learned A LOT from this class!!!!",
                    "58": "Nash helped me learn a lot this quarter. To push myself and reach a new level of public speaking through different kinds of techniques and speeches. Initially I struggled with this topic, but Nash was really caring and pointed me in good directions to improve. I hope this isn’t a class where people just take it as a requirement. That what I thought initially, but after interacting with Nash it really made me care about the class. I spend more time practicing for these speeches than for an engineering exam and I can see the results. Nash really pushed me to become better and that made the value worth it for my time. You should definitely take it with Nash if you don’t want to be bored, if you want to get better, and if you want someone invested in your education. Teaching style was great as well and really made the class cohesive through his interesting stories. The GOAT 10/10 good job",
                    "59": "Nash is AWESOME! I learned so much under his guidance, and his genuine care for our progress made the experience truly enriching. I really enjoyed this course and everything i learned.",
                    "60": "Nash is very understanding of this course being a requirement. Yet, he makes the speeches open, yet directed, in ways that make us want to improve our presentation skills. He genuinely believes that his students are able to be great public speakers, and allows them to hone the skillset in a variety of circumstances.",
                    "61": "Whether or not Public Speaking is a course engineers should be required to take is debatable, but Nash did his best to make it worthwhile and engaging for everyone, and to ensure that the workload wasn't burdensome.",
                    "62": "This class is really light and also super useful! The hands–on nature of this class can be nerve–wracking at times, but that's really the only way actually to improve so I'm glad I took this class. The only downside is the length of each class, but otherwise I loved it.",
                    "63": "Easy A!! Cool opportunity to share whatever you want with the class. It's a very safe environment to speak your mind and know that you'll be heard. Very little work. Amazing class!!",
                    "64": "Good class.",
                    "65": "It was a chill and light–workload class.  Lots of chances to practice public speaking if you want.",
                    "66": "my professor was so good also I feel like I actually got better as a speaker which was nice"
                },
                "school_demographics": {
                    "Weinberg": 5,
                    "McCormick": 63,
                    "Medill": 0,
                    "Comm": 22,
                    "SESP": 2,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 22,
                    "Sophomores": 26,
                    "Juniors": 35,
                    "Seniors": 11
                }
            }
        },
        "COMM_ST 159-0": {
            "2024 Winter": {
                "course_rating": {
                    "average": 5.25,
                    "student_count": 4
                },
                "student_opinions": {
                    "0": "It challenges you to think about how technology influences our routine.",
                    "1": "The five workshops were all interesting and ranged from the basics of coding to using motion sensors. I highly recommend this class if you are interested in learning more about different technologies.",
                    "2": "I enjoyed this course! It’s a little bit long but if the session is very interesting, it goes by quickly. Some sessions were more fun than others, but all provide a base introduction to some kind of technological–comms field/idea."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 4,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 2,
                    "Sophomores": 0,
                    "Juniors": 2,
                    "Seniors": 0
                }
            }
        },
        "COMM_ST 201-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 4.67,
                    "student_count": 24
                },
                "student_opinions": {
                    "0": "The TA was an extremely harsh marker and I spent every week writing 2000 word essays just to get comments like “elaborate more.” The professor did eventually notice the problem and they started marking us. Overall, I feel like class was a bit boring and I didn’t really learn that much.",
                    "1": "I did want to learn about different research methods but i felt like i barely got instruction on how to properly do a research analysis for this class, and there was a lot more content to analyze than i expected. if i didn't take stat 202 prior to this class i would actually be failing because you basically have to learn all of that class in one day. i feel like the second i finished a paper, i had to start a new one. the cycle of writing papers was so draining and never stopped and i don't think i got that much out of it because i was always rushing to finish. there is a reason this class is what qualifies you for a BS it is not for the weak at all.",
                    "2": "The course is very informative, I learned a lot about the different methods used in social science research. Prof Billard is also a good lecturer and tries to make the class engaging. The only issue is I feel like the TA Katherine was not on the same page as the prof about the grading. She would grade the assignments so harshly. The assignments were meant to have a minimum word count of 500 but people were writing nearly 2000 words every week and it still wasn't detailed enough. <br><br>However, a student brought this issue up with Prof Billard and they immediately addressed it with the TA and the students, regraded ALL the assignments (during Thanksgiving too!!), and fixed our grades really quickly. I am grateful and appreciative of them for doing that because it must have taken a long time. I imagine this would not be an issue for future quarters so I would recommend taking this class with Prof Billard",
                    "3": "This class was interesting in that it was super chill for the first couple weeks, but then picked up in the last few weeks with the weekly essays on different research methods. The most engaging part of the class was definitely learning about the research methods, as it's not something I usually think about at all, but now when people say things like \"I'm conducting a focus group,\" I know exactly what they mean by that now. Professor Billard is super chill, and gives us activities where we are having fun, but also learning about how researchers do research. Grading isn't too bad at all either. I'm glad I took this class.",
                    "4": "The class is like a stats class but you never have to do the math. You learn about different types of research methods and how research is used in journalistic articles. Theres about 6 papers you have to write (from week 5 to week 10) and it is analyzing/critiquing a research article and journalistic article. There were some issues with grading as in our papers were graded quite harshly by the TA but Professor Billard clarified and regraded our assignments. Sometimes the research articles can be hard to unpack as they can be quite long. But the research papers are about 60% of your grade while essentially in class participation is the other 40%. If you just come to class and participate in the activities/discussions you should be okay. Professor Billard is extremely nice and they are passionate about the topics. They are more than willing to explain topics into greater detail if confused. <br><br>The class was a bit frustrating with the grading issue just because I felt like I was getting points off based on the critiques I was making of the article and our statistical interpretations were held to quite a high/harsh standard but given that the prof addressed these issues and assuming the TA is different, it is an enjoyable class.",
                    "5": "I came into the course not knowing what to expect and was worried about the amount of work that was going to be given but was pleasantly surprised with the expectations from the professor.",
                    "6": "The TA graded very harshly, and this wasn't resolved until week 9. I put hours into this course, writing ~2000 words a week, to continue getting poor grades on our weekly research analyses. The issue was eventually resolved, and our paper were regraded. But this course was a big stressor and time commitment.",
                    "7": "The course covered a lot of different research methods thoroughly, so it was helpful there. Essay assignments started being assigned weekly after week 5 or so. I think it would've been better if they could be spread out a little more so you didn't have stuff piling on top of each other in the later half of the quarter.",
                    "8": "The course allowed me to manage my time well and my professor made the weekly assignment very straight forward.",
                    "9": "I really enjoyed this course. The professor was highly engaging and clearly highly knowledgable, which made the course both interesting and challenging in a good way. The assignments are manageable, and don't really pick up until halfway through the course, allowing you to build a preliminary sense of research methods. Focusing in on each individual research method through lecture then interactive class activity allowed the concepts to be fully learned and understood. The professor really is awesome too—clearly they want students to succeed.",
                    "10": "The TA is horrible in grading. I got like around 70% on the 2000 word paper I wrote, but Prof. Billard helped fixed the grading problem at the end of the quarter. Overall, nice course just the weekly research analysis assignment is pretty time–consuming.",
                    "11": "The professor is super nice, class was great",
                    "12": "The class had practically no assignments for the first half of the course and then one analysis due every week for 5 weeks. It is easy to keep up and professor doesn't care about grades so does not grade hard.  Can resubmit assignment as many times as you want.",
                    "13": "Although this class has a decent amount of writing, the professor is incredibly accomodating and provides amazing feedback. I apprecated the opportunity to see my mistakes and learn from them",
                    "14": "Not too much work and pretty interesting. Can redo assignments if you do not like your grade and a pretty easy A for a distro.",
                    "15": "This course is a very easy A as long as you keep up with he work and do it on time. Professor Billard was very chill and sometimes added in interactive components to let the class feel more engaging. Overall a very good course to gain knowledge about research, and very easy if you already have an understanding of the topic.",
                    "16": "This class is honestly very interesting and not a heavy work load making it a great balance to learn and not be overly stressed.",
                    "17": "There are good lecture presentations so taking notes is easy and reviewing them can teach you lots of things."
                },
                "school_demographics": {
                    "Weinberg": 3,
                    "McCormick": 1,
                    "Medill": 0,
                    "Comm": 16,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 3,
                    "Sophomores": 18,
                    "Juniors": 0,
                    "Seniors": 1
                }
            }
        },
        "COMM_ST 205-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 4.33,
                    "student_count": 39
                },
                "student_opinions": {
                    "0": "AMAZING PROF! Absolutely loved Professor Lambert. I honestly was dreading taking this course because it had horrible CTECs before and tried to even get out of the requirement. Professor Lambert completely changed the course so it is so much better. He is a great lecturer and is a lot of fun to be in class with. Really happy I had the chance to take this class with him instead of the previous structure because I had fun, it was interesting, and I feel like I actually learned.  Workload extremely manageable! Overall a great course.",
                    "1": "This class is easy, but did not really challenge me intellectually. There were no homework assignments, and the midterm paper counts for a very large chunk of your grade, which was not handed back to us until week 8.",
                    "2": "Take this course if your are interested in AI. It was required that we used ChatGPT or other AI to complete all assignments, which is very rare for a college course. There are weekly quizzes taken in discussion section (without AI) that were actually quite difficult. It sometimes felt like the professor was just rushing through the lecture slides and a lot of what we learned was pretty self–explanatory. There are two major papers, which are very straightforward and clear. The TAs, Emily and Sapna, are AMAZING and helped so much with everything.",
                    "3": "Retook this after having to drop it when it was graded based on just two exams and have to say this course became 10x more enjoyable. I loved Prof Lambert’s demeanor in class so much. Also, his encouragement to learn and understand the benefits of AI tools was much appreciated. Course content will stick with me!!!",
                    "4": "There's no final or midterms for this class. It's made up of weekly quizzes that are five questions which aren't so bad, and two papers that are majority of the grade. They aren't bad but the directions can be pretty confusing. Also, the professor isn't the best at explaining some of the concepts. The TAs are pretty helpful but are kind of strict when it comes to grading. Overall, not a bad class.",
                    "5": "This was a very interesting topic, it was just taught in a very rapid, hard to grasp way. The professor spoke very fast in lectures (though he's a great guy and very funny in class), but most of the important information was easily accessibly by reading the slides outside of class. The grading wasn't particularly harsh and the TA's really want to help you succeed.",
                    "6": "Most difficult comms class I've taken. Tons of memorization of definitions which was really pointless. The work was graded very knit–picky, there were weekly quizzes which again, were 5 total points for 5 questions total and were all about memorization. If you didn't cheat like lots of the class did since they were on computers, they were hard and sometimes brought your grade down. The prof was really great, though, definitely knowledgeable and willing to answer questions. Final paper was so long, there were several papers throughout the course.",
                    "7": "I was so scared to take this class because of the old CTECS, but he completely changed the course, and it is so much better now! There was not a lot of pressure, and I felt like I could learn the concepts for the sake of learning them. There are weekly quizzes and two major papers. The quizzes can be a little tricky, but they're manageable. In the essays, you have to apply all the concepts you learned, and they solidified my understanding even more. If you're interested in persuasion at all, I highly recommend taking this class!",
                    "8": "The material taught in this course most definitely has value, but there are not enough opportunities for students to put class concepts into practice. As a result, I found it hard to actually absorb anything.",
                    "9": "I took this class as an elective and found the material to be really engaging. Great prof",
                    "10": "This class was pretty easy on a week to week basis. He completely redesigned the course this quarter, and I am very grateful for that. There is a weekly quiz that isn't too bad and should only require about an hour of studying. Plus these quizzes don't count too much towards your final grade. Otherwise there are two papers, one midterm and the other is a final paper. Both definitely took a lot of time, but for the course otherwise not taking up too much time it balances out. Also the course focused a lot on learning how to use ChatGPT which I am definitely really thankful for as it has helped me in a lot of my other classes and I know it will continue to help me in the future.",
                    "11": "As an engineering major, this class was interesting because it was definitely unlike any class that's in my curriculum. The class itself is not hard at all. The weekly quizzes are low stakes and very easy if you show up to lecture. The posted lecture notes are  impossible to follow along if you don't go to lecture because there are no examples on them or any explanations. The midterm and final paper were  chill but kind of confusing because the rubric was  bare bones, making it  difficult to grasp what was being asked. Overall interesting and chill class. Professor Lambert is super funny and engaging.",
                    "12": "Overall this was a super interesting course. BUT, I will say that Prof. Lambert was the key reason why this course was so fun. He is an excellent professor, super engaging, eager to help students and knowledgable in the subject area. But, the material is inherently pretty boring, so if this was taught by a prof who wasn't as excited about the material it would be really rough.",
                    "13": "I feel like this is much better than the horrid previous format but I definitely did not learn that much",
                    "14": "I thought it was very tedious, especially the final paper which was 10 pages long. But the TAs were super supportive and sweet, and the professor was nice, just the content I personally found uninteresting and not very challenging.",
                    "15": "This is a very interesting, yet a little abstract course. We had weekly closed notes quizzes during the discussion section and two papers during the quarter(with small assignments about them in between). They are not high stakes and the TAs were amazing in answering questions. The professor really took in constructive feedback and was shaping the course to our needs.  The classes were sometimes monotonous because it was just explanations over slides but a few of the real–life examples made the class stand out and made me understand the importance and applicability of the content.",
                    "16": "This course has changed a lot; I know it was heavily test–based before, but since then, it has changed a lot. All you have is weekly 5–question quizzes, a midterm paper, and a final 10–page paper. Ai is heavily encouraged in this class and is very useful. Professor Lambert may go off–topic, but his lectures are engaging, and his examples benefit the class.",
                    "17": "The material was pretty interesting and Prof Lambert is a great guy. The midterm and final paper assignments were reasonable only thing is that there are weekly quizzes on the lectures which are easy if you just pay attention",
                    "18": "He is actually a pretty funny and interesting professor. He is really nice and actually cares for students his ta were so nice too and helpful.  I highly recommend this class and the class isnt hard because he encourages people to use chat GPT",
                    "19": "It was interesting for the most part, but I would often get bored because Professor Lambert would be talking so fast. I was most interested in learning the different variables in people's behavior and observing when these things are used in real life.",
                    "20": "The teaching approach was really effective.",
                    "21": "The professor is very passionate, but he talked more about AI then the actual class material. I think it will be an easy distro.",
                    "22": "I really enjoyed the new version, though it did have it's growing pains",
                    "23": "This course seems like it has made improvements from previous years, and Dr. Lambert is very knowledgable and passionate. However the structure of this class was an issue. We would cover very complex ideas quickly, making it very difficult to understand them. We had weekly quizzes in discussion section that were helpful, but I wish we spent more time reviewing in discussion. We did not get our midterm assignment back until week 9 which made it impossible to know how you were doing in the class until it was too late. I loved then TAs but they were not helpful when it came to the papers.",
                    "24": "The structure of the course was pretty standard in that lectures were quizzed on at the end of the week. Sometimes the notes felt a bit convoluted with added information that did not feel necessary. Oftentimes I felt compelled to write everything down on the board – even though the notes were provided on canvas – in conjunction to everything the professor said which could get tedious at times. I did find that the quizzes included some tough questions that, like the notes, seemed convoluted but its something you can accept with the courses focus on real world applications.",
                    "25": "I loved this class! The professor engages with the class a lot and is really interesting.",
                    "26": "Absolutely fascinating content that applies to everyday life. I can so much easier recognize and be critical of the persuasive appeals being given to me in everyday life. This year, the professor did a complete revamp of the course, making it much easier than before to my understanding. Not too difficult with such interesting knowledge—a must take for anyone interested in modern persuasion, in my opinion",
                    "27": "Professor Lambert is really structured and prepared, it's CLEAR that he has so much passion about the topic and integrates it well with the current social &amp; tech context. Sometimes the lecture goes off tangent but in a good and interesting way. I'm glad that the class structured was changed so its no longer exam based.",
                    "28": "I really liked how I could apply this to the real world. I can see how each key concept is played out in social media and advertisements."
                },
                "school_demographics": {
                    "Weinberg": 3,
                    "McCormick": 1,
                    "Medill": 4,
                    "Comm": 30,
                    "SESP": 0,
                    "Bienen": 1
                },
                "class_demographics": {
                    "Freshmen": 13,
                    "Sophomores": 9,
                    "Juniors": 8,
                    "Seniors": 9
                }
            }
        },
        "COMM_ST 225-0": {
            "2024 Spring": {
                "course_rating": {
                    "average": 4.59,
                    "student_count": 32
                },
                "student_opinions": {
                    "0": "Lectures were confusing but overall managable",
                    "1": "It was fairly easy",
                    "2": "TAKE THIS CLASS!! I CAN'T EMPHASIZE HOW MUCH I LOVED THIS CLASS. This was definitely top 2 class I took in Northwestern out of my freshman year. The contents are super interesting and the instructors are also super engaging and sweet. You have 4 bi–weekly memos to complete which is super easy. You just need to write a summary, discussion questions, and a meme based on the reading which I enjoyed a lot. You also have one op–ed to complete out of 3 options, which is a 500 words essay based on the topic and the readings. I really liked how they allowed us to choose out of three distinct topics.  The only exam is a midterm which is SUPER SUPER easy, my friends and I got 100. Unless you participate in class, do the readings, and take notes, you will get a satisfying grade from your midterm and just in class in general.",
                    "3": "This is a great course! Go to class because participation matters. There is a midterm and one final group projectI There are a few shorter responses due throughout the quarter on readings. I highly recommend taking it!",
                    "4": "Absolutely must take if you are a comm studies major! This class forces you to think critically and really take on large ideas but Claudio teaches it in an extremely interactive way where class honestly feels like a really interesting discussion. This class has been one of my favorite so far and the workload was definitely a lot (4 short responses, 1 op ed, 1 midterm, 1 final project, and readings due before every class). Honestly as long as you do the reading every class and participate it is an extremely managed A",
                    "5": "Benzecry is really funny and a nice prof<br><br>Assignments<br>– Four 250–word writing responses about a reading<br>– A 500–word OpEd essay<br>– An all free–response written midterm exam<br>– Final Group creative project<br>– Participation",
                    "6": "This is a really interesting class! You learn a lot and the workload isn’t too high! Claudio found multiple creative ways to make the assignments and the class interesting.",
                    "7": "That was a good class. Definitely a nice requirement to take.",
                    "8": "This class is interesting and fun to be a part of if you like discussions, the workload was very fair and the Professor Benzecry is awesome.",
                    "9": "The readings were often really long, which was annoying to get through. I liked the class discussions a lot though.",
                    "10": "Very interesting topic. There are a lot of readings. The mid–term is very doable and the final is subbed with a group project! Amazing professor––he always makes me laugh in class.",
                    "11": "This course is pretty easy (just a few reflection papers and a final project) and Professor Benzecry is a great Professor and clearly very knowledgeable about the course material, but the class itself leaves a lot to be desired. The material and information taught often lacks a clear focus and the lectures can drag on extremely long. Take this class for an easy A, but it is not the most engaging.",
                    "12": "I really enjoyed this class. Originally, I thought that this would be just another class on culture (I've already taken a few), but it ended up to be one of my favorites! The readings were relatively easy, and the professor would underline more important sections. Four times, we had to complete a Memo to assess our understanding of the readings. It was pretty simple because you just had to write 125 words about the reading and then 125 words on your example. You also had to make a meme based on the reading/memo, which was a creative way to show our understanding. Besides that, there was a midterm. This was difficult because the professor doesn't post any slides (so take notes in class!!!). I probably did the most work to prepare for the midterm, but if you do the readings thoroughly before each class and are engaged in class, then it's fine. You do need to handwrite the exam though. The class structure was more or less the same, where we started with some upcoming assignments, transitioned into lectures, and then ended with a small group/ whole class discussion. I particularly loved the class discussions because my classmates were great at making the readings more relatable in our daily lives. There were also really fun videos we watched in class. And something that I should add is that the professor is actually a bit passive aggressive, but I think that deep down he means well. He just wants his students to care about the class material. He takes the time to learn your name. The final project was with a group, and it was not bad (just find people who care about the class and will do their part).",
                    "13": "This was a great course! Super interesting concepts. The professor was great at explaining concepts and making sure everyone's voice was heard.",
                    "14": "The professor is really nice and humorous, but I didn't learn that much from the classes. The discussions about the reading are a bit shallow.",
                    "15": "Super easy and chill class, professor Claudio is really nice,funny and understanding",
                    "16": "easy A class, nice instructor, low effort, easy to manage. Professor's teaching style is funny and interesting, would recommend for distro/major reqs",
                    "17": "Very open to interpretation. Would have liked a more direct approach to COMMS",
                    "18": "A lot of the readings were way too dense and the TAs are unnecessarily harsh graders. Every time we would have to write about a reading they would say to write 200 words but the readings would be 20 pages– pretty impossible to cover everything you need to cover in 200 words so I ended up writing multiple pages to get everything in, and then they would say I'm writing too much, and then I'd write less and they'd say I'm focusing on the wrong thing. I did do well sometimes so I don't think they were trying to be nitpicky but the comments felt really random and subjective. I like the discussion based vibe of the class but then we shouldn't be tested on things in a standardized testing format?",
                    "19": "I think I enjoyed doing the memos and the midterm the most I'm not sure if I loved the final but overall my reaction was good and it is clear the professor cares about the topic.",
                    "20": "The class is very discussion based. There are 4 \"memos\" that you have to complete, but they aren't hard at all. You have to do readings for every class, and you'll discuss them in respect to the slideshow. Claudio is very engaging, funny, and often has no–filter, which makes his classes more funny. He's very receptive to everyone's comments and does his best to make the readings interesting for us. There is also a midterm and a final project, and they are both doable. Definitely recommend this class for Comms major requirement.",
                    "21": "I liked it and liked the professor a lot, it was a required class so I got through it and liked it"
                },
                "school_demographics": {
                    "Weinberg": 3,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 29,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 16,
                    "Sophomores": 11,
                    "Juniors": 3,
                    "Seniors": 1
                }
            }
        },
        "COMM_ST 227-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.03,
                    "student_count": 36
                },
                "student_opinions": {
                    "0": "I really liked this course. Menu assignments were fun and engaging. Exams took hours of studying the night before but were pretty straightforward. If you put in the work, you will succeed.",
                    "1": "The course structure was a little confusing and hard to follow but overall I felt like I learned a decent amount about current technology systems",
                    "2": "Jeremy is such an engaging professor! Thoroughly enjoyed class lecture and material – exams were fair.",
                    "3": "A lot of small assignments but not hard at all, great and fair exams and grading, learned so much relevant info. Definitely take this class",
                    "4": "One of the best classes I've taken at Northwestern! If you take this class (and you should!!!), be ready to put in the work and be engaged in class. You'll learn a ton, and it'll be fun. It's the kind of learning where you walk out of class and want to continue to talk about the material. I also walked into this class as an Undeclared Weinberg student, and I walked out of this class as a declared Comm Studies student in School of Comm (Yay!!!). Once you understand the flow of the lectures and assignments, there is a nice rhythm to the course. I appreciated how there were three weeks for each unit (Design Thinking, Psychological Thinking, Societal Thinking). The professor, TAs, and PMs are extremely supportive and create such a lovely classroom environment.  Things that particularly stood out to me in this class were how 1) there would be random in–class performances where TAs or PMs would pretend something was wrong when it was actually to demonstrate a new concept we were learning in class, or how 2) there were many Mini–Lecturers per class, helping me see how Comm Studies can appear in the workplace or in other industries/fields that I didn't yet know about, or how 3) each class starts with a short student–made video that introduces a new concept. While slides are helpful, it doesn't beat going to class and taking notes and engaging with what the prof is saying. But there were things that I struggled with. For example, whenever we did in–class survey assignments, I often felt rushed to complete it with a partner. Similarly during exams (30–40 multiple choice questions &amp; 2 short–essay questions), I felt rushed to complete it on time. Homework assignments are selected through \"Menu Assignments,\" which gives students the options to choose what assignments they want to do, but it also makes it slightly confusing on what is expected of them (because of the extra leeway) and when.  Speaking of when, it felt like something was due all the time. Monday and Wednesday night, there were low–stakes 1–2 sentence due in response to the homework. Tuesday and Thursday there was class, but sometimes before those classes, you have to complete an assignment. It isn't easy to get an A (but it possible).",
                    "5": "Jeremy is very passionate in teaching and tries his best to make the content very clear for the students. He goes through the contents multiply times until students fully understands it. However, the work load might be bit tough as you are required to complete reading and short (3–5 sentences) responses for every lecture and have 400 words written assignment mostly every week. The exam itself is also based on scenario based, requiring deep understanding with the class material. Nevertheless, as long as you attend the lecture, there is no difficulty in understanding it and get an A.",
                    "6": "This was my favorite but most challenging class. I you are interested in human centered design, human verbal communication, social media algorithms, and data privacy, this is definitely a course to take. Prof Jeremy is really knowledgable and passionate about all topics and I find myself enjoying most, if not all, lectures. There are three sections to the class and each section is 3 weeks and ends with an exam (mcq and 1–2 short answer questions). There is no cumulative exam— it stays within its respective sections. If you do the readings, quick takes, and take notes during class/review them outside of class, the exams are really doable. I enjoyed the topics so it was a little easier to study and do well on exams. There are also two assignments you have to complete within the 3 week section but you have a variety of options from blogs to making your own video. It is quite flexible so I personally enjoyed the structure of the course (a little confusing to understand at first but Jeremy goes over it). Kevin and Nash were the TA’s and they were super helpful in leaving feedback or any questions you had. Jeremy holds office hours before the exam and to me they were super helpful. Office hours are your best friend in this class. <br><br>If you’re interested in the topic I highly recommend the class, it is a decent amount of work but definitely doable.",
                    "7": "This class is pretty interesting and relevant. It is a bit more of a workload than I thought it would be, but you have flexibility in the assignments that you do, which is nice. Professor Birnholtz is engaging and fun, and helps relate the content to our daily experiences.",
                    "8": "I feel like the class is really random and the information we learn is a little silly but the teacher is very passionate",
                    "9": "I loved learning about how social media and the internet works in terms of search engines, algorithms, and moderators. I was interested by the controversies surrounding these aspects of the internet like privacy and data collection.",
                    "10": "All the content covered was extremely important and relevant to contemporary life, and will help me not only understand the topic of communication studies better but also my everyday life much better . I so appreciated that our professor covered such large societal issues without catastrophizing about them. I also appreciated that the course started with a primer on Norman's design theory. It provided a good foundational framework of knowledge and thinking for not only the topics we would cover later in the class, but also topics beyond this course. <br><br>This class has a moderate amount of work, but overall I'd say is still very very reasonable. The content was also super important. Overall a useful course to have taken.",
                    "11": "I took this class even though it didn't fulfill any requirement for me. I thought it seemed interesting. I was pretty dissatisfied with this class. The subject matter is interesting but all of the mini assignments make this class full of what feels like busywork. Honestly, I would not recommend taking this class.",
                    "12": "Professor Birnholtz cares so much about the class and it's so much fun because of him. As long as you do your work, the class is a relatively easy A. The tests are pretty intuitive, but the readings can be difficult. There are a lot of them.",
                    "13": "My reaction to this course was surprised how much we talked about. Not only did we talk about communicating with each other, but we also learned about technology, along with money.",
                    "14": "This class is fascinating. The different technologies in our society are ever changing and this class is very relevant to take in the age of AI. It is definitely a bit of work to understand things and some of the assignments are graded pretty critically. However, you will start to get the hang of it halfway through. Definitely not an easy A but I am proud of my B because I am leaving the course knowing that I learned a lot.",
                    "15": "Highly recommend this class. Jeremy is a chill professor and loves what he does. The class was structured into  three parts, each with very interesting topics. Workload is not bad at all, just weekly short essays that you can also replace with an undiscussion session, which is basically just doing a group worksheet outside of class. Some of the readings are challenging but Jeremy is great at explaining and clarifying what the important takeaways are. There's three exams, but they're not bad if you just pay attention and take notes on the slides. Probably one of my favorite classes I've taken at Northwestern. Moderate workload and learned a lot.",
                    "16": "YOU SHOULD TAKE THIS CLASS!! Although the class sounds broad and profound, Professor Birnholtz did an excellent job in breaking down the concepts and theories in class and make it an extremely interesting class. I love every part of the class, especially the mini lectures in almost every class and the great freedom we have in completing our assignments. The reading and the assignments are challenging but fun. Go for it!!",
                    "17": "Very well–taught and really interesting course!",
                    "18": "I really enjoyed most sections of this course, but felt that some were more pertinent than others (didn't love the focus on ethics/inequality and felt it could've been worked into all other sections and distributed evenly throughout the course as certain topics came up",
                    "19": "Really good course with a passionate teaching staff. Will get you to rethink the role of social media in your life. Super relevant for the comm studies major and probably most undergraduate students.",
                    "20": "Really interactive, kinda need to go above and beyond on participation to get all the credit.",
                    "21": "I recalled liked how interactive it was and how we did assignments with classmates based on the topics we were learning in class.",
                    "22": "This class was interesting in that it makes you view things in your everyday life in a different way like how you interact with machines and objects, social media, privacy, and human interactions. There are a lot of small assignments that you have to keep track of, but assignments and exams are not difficult if you pay attention in class and take notes.",
                    "23": "The menu assignment system can be very overwhelming and confusing in the beginning, but you get used to it. I enjoyed our readings and the content we learned, although it got hard in the last part of the course. Recommend for people interested in the intersections of design, technology, and communication",
                    "24": "I highly recommend this course. I am in McCormick and was taking this class as a theme (distribution) requirement so I did not have super high expectations. I was pleasantly surprised; this class, although it touched on topic areas I was familiar with, went above and beyond in depth and scope and really taught me a lot about the complexities that influence communication and technology.  I regularly taught my friends fun facts I had learned in the class and found daily examples of how the stuff I was learning was applicable in my life. I appreciated how the class does not gloss over the technical aspects of technology. Workload wise this class was very manageable and fair. There are menu assignments meaning you get to choose what assignments you want to do (videos, blogs, group projects, etc). There are three exams which also were fair. The content is only about 3 weeks and they are not cumulative so it wasn't bad if you studied the key terms beforehand. Readings were not very long  (you also did not need to them in super detail to understand the class) and lectures are very engaging.  Having not taken any comm st class prior, I did not feel unprepared in the slightest.",
                    "25": "What an amazing introduction to my new major! I absolutely loved this class because despite the challenges of grasping some of material during application, a lot of it was relevant to design and technological developments. The exams were not the worst, and maybe it was just my overthinking self,  but the concepts are for the most part okay to understand. It just became a bit overwhelming when so much was packed in a few weeks, but that's just the quarter system.",
                    "26": "Obviously, for many students, the most important aspect is how the grading will occur. The course gave students some flexibility which was nice. Besides the three mandatory exams, there were a plethora of assignments to 'choose'(you had some autonomy but there were a few requirements) from which was a nice change from many other courses. However, if you are one who struggles with time management/independent assignments, it may be a struggle to keep yourself on track with the assignments. The professor does give you reminders though."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 2,
                    "Medill": 1,
                    "Comm": 28,
                    "SESP": 2,
                    "Bienen": 1
                },
                "class_demographics": {
                    "Freshmen": 10,
                    "Sophomores": 15,
                    "Juniors": 5,
                    "Seniors": 6
                }
            }
        },
        "COMM_ST 261-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.36,
                    "student_count": 28
                },
                "student_opinions": {
                    "0": "I think this is the first class that I feel isn't so bogged down in theory, and has actually displayed the practical applications of the course concepts",
                    "1": "This course was a great introduction to careers in strategic communications. Professor Shumate is incredible and she ensures that class is full of discussion, rather than just lecture.",
                    "2": "the class is quite engaging and interesting, but not too difficult in terms of workload and exams.",
                    "3": "Excellent course with very interesting lectures. My favorite part was having a weekly “Case Study” that incorporated the week’s concepts while also fostering productive class discussion.",
                    "4": "This is a great course! Professor Shumate is a great professor and is very generous. The assignments require real–world application so you actually feel like you're learning something that will be useful later on. There's a ton of practical application, rather than just studying theory. You get to choose which assignments you want to do (for the most part) to tailor the class to what you're interested in learning. There are two in–person exams, but she gives you study guides with the material ahead of time and you can bring a notecard into the exams. Definitely recommend this class for anyone with an interest in communications, marketing, HR, etc.",
                    "5": "This course teaches concepts of strategic communication through reading materials which cover concepts and terminology. Students then apply the knowledge gained from readings to case study assignments where the concepts can be applied to situations to offer critiques of strategic communication and areas for improvement. The exams test knowledge on these assignments and the reading and class materials content. The practicum assignments focus on using the course concepts to create and analyze strategic communication materials.",
                    "6": "Pretty practical class! Prof. Shumate is very passionate and the assignments are pretty hands–on and pertinent to what you're learning. Liked the flipped classroom style of reviewing course material before and covering what our questions were in class, and had group discussions which helped me to get to know more people.",
                    "7": "i really liked this course and both professor shumate and yeha (the TA) were great at leading/instructing this class throughout the past ten weeks! i've always thought the concept of strategic communication was very interesting, and so i appreciated being able to learn more about this field through this class. the way michelle designs this class is very lenient in terms of grading, since we are given 3 oops tokens that can be used to turn in a late/missing assignment or also to re–do any exam! i think this definitely reduces the burden of focusing only on getting the highest grade possible, and ensures we can focus more on the actual learning. highly recommend this class for a 200–level elective!",
                    "8": "Great class, a lot of practical assignments. Prof Shumate is also very lenient and understanding. Highly recommend",
                    "9": "This course is okay but there is a lot of busy work. There are weekly case studies, weekly readings with a discussion post associated with it, 4 practicums throughout the quarter where you do something like creating a social media calendar or design a newsletter and 1 midterm and a final. The midterm and final consist of MCQs and SAQs but the teacher prepares you for it by hosting a review session and giving out a study guide. Lectures can get a bit dry but overall you do learn more about the practical applications of communications and its importance in organizations.",
                    "10": "I took this class for the Organizational and Strategic Communications module, and I really think that this class sets a very good foundation.  The tests are pretty difficult and require studying, but you can redo them so they aren't super stressful and I definitely put off studying a lot for it (final was during reading week but pick up to do corrections is during finals week)",
                    "11": "Course was fair and interesting",
                    "12": "The case studies and practicums were most beneficial, for they allowed you to apply the knowledge you gained from class and readings.",
                    "13": "This class has a higher workload than most other comms classes I've taken so keep that in mind. I learned a lot in this class and really enjoyed the content highly recommend.",
                    "14": "Great class! Michelle is a really engaging lecturer, super passionate about strategic comm. work consists of readings, muddiest points (rlly quick discussion posts), casse study (1 page analysis), and practicums (various assignments where you apply course content and analyze + implement strategic comm strategies). 2 midterms (multiple choice and one page short responses)",
                    "15": "This is a great class in theory but being at 9:30 am makes it incredibly difficult to show up and pay attention. The concepts are kind of intuitive so you also don't really need to pay attention save for learning specific terms for phenomenon that is obvious. The midterm and final are incredibly easy because Prof Shumate gives you a very generous study guide with all the possible questions. The case studies are also easy but have very high opportunity for learning. The practicums are kind of silly to be honest although well intentioned. They were expected to be a portfolio we could show future employers but the assignments don't really make sense to show employers.",
                    "16": "If you're comm st major looking for 2nn course, TAKE THIS! Really manageable A, revolves around case–study that comm st ppl tend to like. Will not learn that much, but that's general theme of comm st so",
                    "17": "Felt it was grounded in practical situations which I appreciated",
                    "18": "This course is beneficial, especially if you are considering a career in the communications industry. There is a lot of room for you to gain real–world experience through the practicum assignments. Aside from that, you have two exams, weekly discussion posts, and 1–page case studies. Great class would definitely recommend it.",
                    "19": "TAKE THIS CLASS!! I'm not a comm major but I think is class would be helpful to anyone in any major. You really get an understanding of all the divisions of communication and all how each of them used. Professor Shumate is great. There are a few assignments every week, but they are low stress and not that much work, especially because Professor Shumate gives you the opportunity to revise a lot of your work. There is readings, a discussion post based on the readings, and a case study as well as 4 total practicum assignments that you will do throughout the quarter, and 2 exams. The exams were not bad at all. Do the readings because Shumate does not cover everything in the textbook in class – she only covers what people are confused about. This is a really great class to get some practice and knowledge of strategic comms!!",
                    "20": "The course helped me learn about integrated communication, how organizations communicate messaging, and the practicums. We had the opportunity to make newsletters, press releases and editorial calendars.",
                    "21": "The TA's and the professor are willing to help your grade."
                },
                "school_demographics": {
                    "Weinberg": 2,
                    "McCormick": 2,
                    "Medill": 0,
                    "Comm": 24,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 1,
                    "Sophomores": 10,
                    "Juniors": 11,
                    "Seniors": 6
                }
            }
        },
        "COMM_ST 290-0": {
            "2024 Winter": {
                "course_rating": {
                    "average": 5.4,
                    "student_count": 5
                },
                "student_opinions": {
                    "0": "Great course",
                    "1": "Dr. Fitzmier is a great instructor, phenomenal debate coach, and works to meet students where they're at. I heard he also teaches a pretty fun public speaking course. Take a class with Dr. Fitzmier you won't regret it.",
                    "2": "Yes"
                },
                "school_demographics": {
                    "Weinberg": 3,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 0,
                    "SESP": 1,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 2,
                    "Juniors": 2,
                    "Seniors": 1
                }
            }
        },
        "COMM_ST 295-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.46,
                    "student_count": 13
                },
                "student_opinions": {
                    "0": "I think the course materials were my favorite part, most notably, Parable of the Sower by Octavia Butler. This book literally changed my life and have been able to relate it to so many different facets of my life as well as other course I was taking in the quarter. This course helped me interpret ways of processing the future and how i can imagine it.",
                    "1": "I really loved this class. This is my second class with this professor, who I love.  The workload is super manageable and the class discussions are really interesting.",
                    "2": "I cannot emphasize this enough: TAKE THIS CLASS!!!!!! Dr. B is an amazing professor and this class was so interesting. We learned so much about speculative fiction, writing short stories, imagining new futures, Afrofeminism, and authors/activists like Octavia Butler. By far my favorite class of all time. The workload was manageable; I am a chronic procrastinator and still managed to get everything done. The assignments were 3 blog posts and 2 replies, a short story, and presenting the research you did for your short story. Dr. B offered plenty of extra credit as well. She also doesn't grade attendance or participation, which made the class more accessible for me. All in all, a fantastic class and I hope to take another class with Dr. B in the future.",
                    "3": "This was not the class I expected it to be, but I was pleasantly surprised. Lovely professor and great topics! It's such a creative course.",
                    "4": "Dr. B is a great professor in that she clearly cares a lot about exploring dystopian futures and unleashing her students' creative abilities. I will say, though, most of the homework is very reading–heavy. So if you're not an avid reader, I would discourage taking this class. By the end of the quarter you will make a story of your own  based on your own research project regarding a modern–day problem (ex. climate change, genocide, medical malpractice, racism, etc.) and have to respond to 4 different blog posts. It's a pretty interesting class, but certainly demanding if you're not into science fiction or creative writing.",
                    "5": "I loved this class so much! Its such an interesting topic, and Dr. Bailey is the kindest person! I was not sure what to expect when I first took this course, I am not a person who does a lot of creative writing and that's what the final project is, but I learned so much and everyone was so kind about helping each other out in and out of class.",
                    "6": "Readings are very fun and interesting and it didnt feel like homework at all. I loved this class and Professor Bailey always made sure to give us strong feedback. She always created a happy environment in class and that made me want to come to lessons even more"
                },
                "school_demographics": {
                    "Weinberg": 4,
                    "McCormick": 0,
                    "Medill": 1,
                    "Comm": 6,
                    "SESP": 2,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 3,
                    "Sophomores": 4,
                    "Juniors": 4,
                    "Seniors": 2
                }
            },
            "2024 Spring": {
                "course_rating": {
                    "average": 4.88,
                    "student_count": 17
                },
                "student_opinions": {
                    "0": "The content can be a bit boring at times, but the real–world discussions were very interesting.",
                    "1": "Prof Iden is hilarious, entertaining, and cares about his students. He is helpful in office hours and always willing to discuss ideas further. The class material was a bit dense and lectures were disorganized. It often felt like we were being talked at rather than discussing.  I did not enjoy the material but I did like the professor.",
                    "2": "I loved Professor Iden and had a wonderful experience. Not necesarily the easiest A.",
                    "3": "Overall, I think this class is well designed and the professor is very patient when it comes to explaining different points.",
                    "4": "Class was okay, feel like wasn’t super interesting.",
                    "5": "This was definitely an interesting class in terms of topic. It was mainly about understanding the framework in which Corporations/Companies have to make decisions regarding Corporate Social Responsibility (CSR). Coming into the class I was quite certain that my mind wouldn't be changed in terms of thinking that Corporations are all just bad. But through the course, Randy really forces you to think about it from the Corporation perspective and how it is not as simple as making a certain decision just because it may be morally right. The topics can be dense at times and sometimes dry but overall I did enjoy the class.<br><br>The course is slightly unstructured. In terms of assignments, there were weekly discussion posts (you post 2–3 times then on the weeks it is not your group to post you need to reply to the other posts) and four short 1–2 page paper options (only need to do 3). And there is a final paper at the end (5–7) pages. He is honestly really flexible with deadlines which is nice but also means sometimes I didn't really know when certain papers were due. The coursework isn't hard compared to other Comms classes but the topic can be dry at times. Lectures sometimes can be hard to deeply engage yourself in because of the dense nature of the topic but I did enjoy them.<br><br>On another note Randy is super funny and does a good job at trying to get us engaged through discussion. He makes jokes often and I did enjoy coming to class.",
                    "6": "Randy is a hilarious individual that has many great thoughts to share. At times, however, the topic of this class may feel a bit repetitive but Randy does his best to keep things interesting and challenge students to think beyond.",
                    "7": "I had mixed feelings about this course. The content could be boring at times but it was also very important to the world in general. Professor Iden can often times talk for hours but he is engaging and keeps the atmosphere somewhat lighthearted. I think it is the nature of the content that keeps this class from being fun but it is not overly difficult. Professor Iden tries his best but sometimes it gets tough to feel motivated for the course.",
                    "8": "I really liked this course because I wanted a more business focused communications class. Randy was very knowledgeable in the topic, but it was sometimes hard to focus because they were long lectures. However, Randy was a really amazing teacher. If you have the chance to speak with him I would really encourage it.",
                    "9": "good course – was a bit repetitive at times, Professor Iden is very nice, but I would have appreciated a bit more variety",
                    "10": "This course evaluated the dissonance between many corporations’ claimed intentions versus their actual actions, whether that be under the context of environmental sustainability, general profit, diversity and equity statements versus actual hiring practices, etc….",
                    "11": "I liked this class a lot and thought it was very interesting. Randy was an awesome teacher and made it more engaging.",
                    "12": "Although I do not have a lot of interest in the subject, I think the professor made it worthwhile to engage in the class.  The readings could have been better discussed as they relate to each other, and sometimes, it did feel like it was saying the same thing. But they were still pretty great. Discussions can be very fruitful depending on each student's engagement, so it is up to the student to take out as much of the course, I'd say.",
                    "13": "Professor is entertaining and tries his best to make material interesting(it's a pretty mundane topic to start with). I liked his teaching style and class, definitely recommend for anyone looking for a 200–level easy and interesting class to do. Discussion posts &amp; a few short papers + one final paper, very manageable &amp; professor generous with deadlines. 10/10",
                    "14": "I did not know what to expect going into this course, but I really enjoyed class. It was a super engaging class that allowed us to deeply analyze the semantics and rhetoric behind companies CSR and their commitment to said cause and values. I found it extremely interesting and am walking away with a different perspective about ethics."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 17,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 6,
                    "Sophomores": 8,
                    "Juniors": 3,
                    "Seniors": 1
                }
            },
            "2024 Winter": {
                "course_rating": {
                    "average": 5.228709677419355,
                    "student_count": 31
                },
                "student_opinions": {
                    "0": "Dr. Scherr is an amazing professor. She is clearly very passionate about risk communications and extremely knowledgable. There isn't too much work– one assignment for each class– you can skip 3, and a final paper that is broken up into parts. The course is very interesting and I learned a lot.",
                    "1": "Professor Scherr was a very good professor. She wasn’t super exciting all of the time but taught us the material well. The class itself was very straightforward and if you keep up with your work it should be relatively easy. Lastly, follow the rubrics on projects, it’s that simple.",
                    "2": "I really like how this course was structured. Most classes started with a small lecture and then were followed by an interactive activity with your group. The professor was super organized and brought up very engaging topics.",
                    "3": "The class is great in many ways—the content is super useful and interesting, the prof was an engaging and knowledgable lecturer—but the class was a lot more time consuming than I expected it to be. Some of the homework assignments are very finnicky (ie, the hypothesis assignments) and I did feel like the engagement activities were a lot of unnecessary work. In terms of intellectual challenge, this class is not too hard.",
                    "4": "This course is an easy one to get through. Does require a little bit of outside of class effort, but attendance is also not required. Mostly underclassmen and athletes. You have to write 2 smaller papers and one larger paper throughout the quarter. The one thing that really irritated me was that the homework reading reflections were due at 10 am the day BEFORE class, and that is just not how I operate so that was the big deterrent.",
                    "5": "I enjoyed creating a risk campaign and writing/presenting about it!",
                    "6": "Great class to take! Workload is not too much or stressful. Professor Scherr is great. It's an interesting topic, and I feel like I learned a lot about it.",
                    "7": "Dr. Scherr is amazing! Take any classes with her if you can—she's super chill, very engaging, and extremely knowledgable (especially in the area of risk/health communication). This class was also super chill, just do the assignments and you can get a good grade.",
                    "8": "I really enjoyed Professor Scherr's teaching as well as the guest lectures from Hannah the TA. The slide shows were very interesting and I enjoyed the in–class group work. My one issue was with the length of many of the articles – I found them very overwhelming and sometimes redundant.",
                    "9": "Interesting class, you learn a lot about the theory behind risk communication and practical applications. There is kind of a lot of small assignments (had to complete one before almost every class) but it was good that we could drop a few because it's out of a certain amount of points. The final project is pretty long but since you have to complete some of the paper earlier in the quarter it wasn't too bad. Overall would recommend taking this class!",
                    "10": "It gave me confident  public speaking, communication, and career knowledge",
                    "11": "the concepts were interesting and the theories are stuff I can bring up in other classes and potentially in real world situations",
                    "12": "I really liked this course, apart from the timing of the class time, it was really. enjoyable. i think the readings were interesting and not too boring. My favorite part was learning about branding and getting to discuss it in class in a general and specific context to art and luxury items.  Probably one of the only classes at NU where the professor was truly interested in their work and their students being involved",
                    "13": "I learned a lot in this course! It was extremely interesting and the readings and class were great at teaching a subject I had never been exposed to or thought of. The readings were difficult but she provided a reading guide and broke down what to read from each part and what to look for, which was extremely helpful!",
                    "14": "So far my favorite class at NU. Can't believe how much I learned about the art market. And everything is super interesting and engaging. The professor is super passionate about the topic and she shared lots of materials from her own research. We also had plenty of hands–on practice analyzing some market data for the class project. Would definitely recommend taking this course if you are interested in arts!",
                    "15": "This was a really great course.  I had zero interest in contemporary art markets but feel I genuinely learned useful material. Even though it's unlikely that I will work in the contemporary (or any) art market, I appreciate learning for learning's sake and feel a lot of what we covered is useful for thinking about various social and economic issues even after college. <br><br>The workload was super manageable, and I personally appreciated only meeting once a week despite the 3–hour class time. We had Canvas posts due every Wednesday based on the weekly readings, and much of the actual class time consisted of Prof. Buchholz using the questions we asked in our posts to complement the lecture and encourage class discussion. I very much appreciated that she not only read all of our posts, but also summarized them and took the time to incorporate all of them into her material. We also got to work on a case study, and I appreciate that we didn't have to do any out–of–class group meetings; everything was very manageable. The class was organized extremely well, and you can tell she cares about her students' success. She brought coffee and snacks every so often and was very empathetic about the potential fatigue of taking a 3–hour afternoon class. Definitely take this class if you can!",
                    "16": "This class was pleasant from beginning to end. You’ll learn a great deal while not feeling overwhelmed by the content you’re learning.",
                    "17": "This class is so interesting and well–built – the way that Professor Larissa structures class slides by incorporating everyone's reading memo is amazing. Highly recommend.",
                    "18": "This is by far my FAVORITE class I have taken. You learn primarily about the Art Market but often connect it to other cultural markets. There are weekly readings that can be quite dense at times but are very interesting if you have an interest in the topics. Larissa is super passionate about teaching and despite being a 3 hour class on fridays, I look forward to it every week. She has a lot of knowledge in this field and has done a lot of research so it class is very engaging. This is a HEAVILY discussion based class though. There are short weekly memos but class time is spent almost exclusively discussing the readings and making connections. There are in class (ungraded) data exercises which are stimulating as it is data she has gathered for us. Short memos, in class discussions, participation, and one cumulative final is how your grade is determined. If you are looking for an easy class, I wouldn't recommend this as the readings can take up to an average of 4 hours per week, but this is a very rewarding class for those interested in art/cultural markets, branding, and econ/marketing."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 30,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 2,
                    "Sophomores": 12,
                    "Juniors": 9,
                    "Seniors": 8
                }
            }
        },
        "COMM_ST 315-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 3.64,
                    "student_count": 11
                },
                "student_opinions": {
                    "0": "its a heavily a lectured class, but the professor is extremely kind!",
                    "1": "Course was pretty good professor kinda boring but overall easy",
                    "2": "The class was interesting and it was easy to feel engaged enough to get an A.",
                    "3": "This is not a super engaging class –– lectures are pretty unengaging, and writing prompts are really confusing. Would not recommend the class or the professor. Also may have been me not being interested in the content.",
                    "4": "Course subject is interesting, but you don't really learn much. Class is not engaging, and concepts are not explained in depth.",
                    "5": "Take this class. Dilip is the best and it is a relatively easy A with 5–6 papers sprinkled though out the quarter. He does take attendance but those are the only grades."
                },
                "school_demographics": {
                    "Weinberg": 2,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 9,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 2,
                    "Juniors": 6,
                    "Seniors": 3
                }
            }
        },
        "COMM_ST 317-0": {
            "2024 Winter": {
                "course_rating": {
                    "average": 4.2,
                    "student_count": 10
                },
                "student_opinions": {
                    "0": "Kinda boring class not super engaging. Easy not too much work.",
                    "1": "We didn't get through everything for the quarter, but I thought the material/lectures were really interesting! This class is HEAVILY lecture–based, minimal outside readings, and 4 short papers (500–600 words) and 2 longer papers (but ours got modified to one 8–page paper for the final since we ran out of time). All in all, if you're interesting in politics or the history of democracy/ various political structures, this is definitely an interesting class to take.",
                    "2": "This class was interesting, but I often had a hard time keeping up with the professor. The assignment due dates were not published on the syllabus so I found it a bit hard to organize notes and planners. Overall the class is not bad, we had 3 short papers and 1 mid–size paper.  Sometimes it can be a little hard to understand what the assignments require but the stakes are usually low (12.5 points) and the TA is a fair grader.",
                    "3": "I found this course to be pretty boring, lots of long lectures. It seemed like everyone seemed to drift off or surf the web the whole time. There wasn’t a ton of dialogue or anything. Just lots of talking at us.",
                    "4": "The professor really knows everything there is to know about the subject."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 8,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 3,
                    "Juniors": 3,
                    "Seniors": 4
                }
            }
        },
        "COMM_ST 321-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.71,
                    "student_count": 7
                },
                "student_opinions": {
                    "0": "fantastic course. great discussions. professor Z is amazing at meeting students where they're coming from and relating the topics of the class to the POV students bring.",
                    "1": "Prof Zidani is an amazing prof – loved the smaller group setting. papers and grading was very fair!!! recommend this class to anyone interested in broader areas of social media and cultures – final paper allows you to explore whatever you're interested in! Prof Zidani was super engaging and helpful, would take a class again with them!",
                    "2": "Dr. Z is the best, and because of the size of this class you're able to actually have discussions about the material. The nature of the class is that almost anything that interests you is relevant, so it's very intellectually freeing. Reiterating that Dr. Z is the best and this was a wonderful last class for me at NU!",
                    "3": "Media and Publics is a broad subject matter, and this broadness ended up having positives and negatives. On one hand, we covered a lot of different topics, a lot of what I was interested in, like music, the internet, memes etc. On the other hand, I sometimes felt the direction/ conversations our class was taking were a bit too generalised/ wishy–washy because our class could literally apply to so much. That being said I am glad I took it, I only wished we could have dived into more specifics rather than beginning a new topic every week.",
                    "4": "I really enjoyed this class. The professor was always very understanding and allowed for everyone to express themselves and share their opinions. There was a reading response every week about the readings and then a final paper.",
                    "5": "Professor Zidani is such an amazing professor!!! I LOVED HER. Take this class– we learned so much about how different Publics use media. For the final project you can do something creative, which is super fun. Not a lot of work and very doable class. She brings in guest lecturers too and the class is very engaging."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 7,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 1,
                    "Juniors": 2,
                    "Seniors": 4
                }
            }
        },
        "COMM_ST 324-1": {
            "2024 Winter": {
                "course_rating": {
                    "average": 5.54,
                    "student_count": 13
                },
                "student_opinions": {
                    "0": "Angela Ray is a fantastic professor. Classes consist of group work relating to rhetorical strategy and class–wide discussion. You will learn a lot in this course. Even if you do not necessarily have an interest in the rhetoric of the women's movement, this course will teach you useful rhetorical analysis strategies. It will improve your skills as a writer. There are three analytical essays and a final exam. I cannot recommend this class enough, nor Professor Ray.",
                    "1": "Doctor Ray is one of the best professors I've had at Northwestern. All of her lectures are engaging and encourages active participation from students. She's never condescending and wants her students to succeed. Doctor Ray creates a classroom environment that encourages students to participate freely. She is not an easy grader but wants her students to achieve; doing well in the class feels great! She''s always open to meet and discuss assignments. I learned so much and classes were never boring. There are only 4 assignments: three five page rhetorical analysis essays and a final exam. If you are good at analyzing quotes you will do very well in this class!",
                    "2": "Professor Ray is amazing and is so knowledgeable about everything she is teaching. It was awesome to get to learn under her and this was honestly a great course. A manageable level of work and I felt like the work was all very purposeful, no busy work. Workload consisted of three essays for the quarter (5 page rhetorical analysis essays which were not bad, you honestly need the 5 pages to say anything) and a final two–hour exam with two essay questions. Also have to do the readings to participate in class, but she picks really interesting readings that you will want to do (or will want to at least skim to make the lecture meaningful). Overall, I really loved it and I would argue that it is one of the most informative and interesting comms classes I have taken at NU (I am a senior). Highly, highly recommend if you are interested in dissecting historical readings and gaining a deep understanding of the women's rights movement!!!",
                    "3": "This was such an amazing class! Dr. Ray is an engaging professor, and the topic is fascinating! The analytic essays are manageable and so are the readings, but you definitely need to do them for class participation.",
                    "4": "Angela clearly knows a lot about the subject and is very enthusiastic about teaching it. Definitely possible to get an A if you pay attention to her requirements for the papers and for the final. The final is basically an extension of the papers so you'll know what to do at that point",
                    "5": "I loved this class! One of my favorite Comm classes I've taken at NU. Dr. Ray is very passionate and knowledgeable about the subject which made it even better. Most people were very participatory, so we had really interesting class discussions. I enjoyed learning about the women's rights movement from a new perspective that I had not studied before.",
                    "6": "I must say when I signed up for this class, I was dreading it and I did not think it would be interesting at all, but it has proven to be a very interesting class with a light course load.   Where are readings and three 5 page essays, and the final is two essays in two hours which sounds kinda scary, but based on my grades from the other essays, I don't think it should be that bad.  I wouldn't say its an easy A, but if you try and participate in discussion you will be good.",
                    "7": "This course really opened my eyes to the origins and effects of the U.S. Women's Rights Movement. It was quite interesting to learn more about the most famous activists during this time and debunk some myths that I had believed from my early years of schooling. I would highly recommend this course if the topic is interesting to you! The work wasn't overwhelming, and it all felt meaningful. Professor Ray is super engaging as well!",
                    "8": "This class had a lot of reading which are all interesting, but you end up talking about it in class so it's not too bad if you skip a reading. I skipped a couple of classes but still participated well in the discussions of all other classes but still got a 35/50 in participation so you should probably go to class. <br>3 essays, 1 final (2 essays in 2 hours). not bad, Dr. Ray doesn't grade harshly and she gives lots of notes on your papers. (the cursive is kind of hard to read sometimes)<br>Overall, very interesting if you are interested in legal studies or gender studies. Kind of reminded me of AP Lang."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 13,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 5,
                    "Juniors": 5,
                    "Seniors": 4
                }
            }
        },
        "COMM_ST 339-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.2,
                    "student_count": 5
                },
                "student_opinions": {
                    "0": "This class was great! Professor really cares about this subject and is very encouraging and open to discussions. The class was also very small too, which made it easier to speak up.",
                    "1": "It was a very small class, so we could talk about whatever we wanted. Professor Scherr is very kind and very understanding of the students, and it was a generally stress free class. It was a nice environment to learn about something like precision medicine which might not be known by a lot of people in detail.",
                    "2": "The course really helped you think about relevant topics in medicine and to consider the intersection of various disciplines in health outcomes. You really get to learn a lot and it can be very theory heavy sometimes, but Professor Scherr does a great job in breaking down the subject and providing real–world implications and limitations.",
                    "3": "I wish there were more real life examples/applications of the theories.",
                    "4": "This class was great! I learned a lot with no prior background! Class work was not too difficult and the grading is pretty straightforward. Dr. Sherr is also a great professor and has a lot of knowledge!"
                },
                "school_demographics": {
                    "Weinberg": 2,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 2,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 0,
                    "Juniors": 2,
                    "Seniors": 2
                }
            }
        },
        "COMM_ST 340-0": {
            "2024 Winter": {
                "course_rating": {
                    "average": 4.71,
                    "student_count": 38
                },
                "student_opinions": {
                    "0": "The readings were extremely interesting and the guest speakers were very valuable. Besides that though, the course was a flop. You should take if you want an easy A but don't expect a super engaging course or intellectual discussions. Very poorly organized and basically ran by the T.A. Syllabus was never posted either.",
                    "1": "This is a very interesting course. I would recommend it to open your eyes to people other than yourselves. All that is required in the class is that you show up, participate, and reflect on the weekly reading. Paul is not like your average Northwestern professor. He does not care about long papers, intense exams, or crazy things like that. All he wants to do is educate and empower his students, which is very refreshing.",
                    "2": "The class ends an hour early every time, and Paul gives breaks between the hour. The class work was engaging but not difficult at all, and Paul is really understanding and willing to work with you as a student. I 100% recommend this class, it’s like a breath of fresh air compared to other classes offered at NU.",
                    "3": "Great class! Paul is such an entertaining lecturer, even though he struggled with some illness throughout the quarter. You learn a lot about those with differences, not disabilities, in such a meaningful way. Paul is literally one of the leaders in this field. Highly recommend.",
                    "4": "This class should be a must–take for everyone who has the chance to take this. Every week Paul brought in speakers to supplement the concepts discussed in class. Everything was super powerful and non–traditional for a NU course. We had 10 weekly response posts and weekly feedback at the end of class. This is not a difficult class but that's not the point –– it's supposed to be a class that differs from a traditional, stressful NU class that has info going in one ear and out the other after the quarter ends. Instead, this class is real learning and causes perspectives to change. Thank you Paul for an amazing class! And NU Comm department –– please keep this class going ;)",
                    "5": "I loved this course because it highlighted really important issues and inequalities.",
                    "6": "The classroom environment created felt almost therapeutic.",
                    "7": "I liked this class because of the guest speakers. It was also did not have any tests which made me want to learn more",
                    "8": "Paul is a great professor. He had many speakers come into class to speak about their experiences within the subject, which helped connect the students to the overall message of the course. This is a highly emotional class, but really interesting. There is minimal work. The only requirement is a weekly reflection on a reading (as well as class attendance).",
                    "9": "Great professor. Couldn't recommend more",
                    "10": "Very chill and interesting class. I really enjoyed the readings and talks from guests. I wish the time was not in the evening because I felt often too drained to take the most out of this class",
                    "11": "This class was the easiest class I've taken at NU. We only had one 1 page reflection due each week and that was it for the quarter. Professor is funny and brings in some cool guest speakers",
                    "12": "Definitely recommend. The class is really, really chill. Honestly, you don't do any work outside of a couple easy readings a week and a one page reflection. He is so chill and this class is more about wanting people to better understand the needs of others, particularly making students actively think about disabled people and the rights they are given in society. He brings in weekly speakers which are interesting to hear from and ask questions. Professor also really cares about the mental health of the students and lets students out very early (it never went over two hours). Overall, extremely chill and would recommend if you're able to snag this class during registration.",
                    "13": "I loved this course. Prof Arnston is the best and so nice and understands we have a life outside of his class which many professors do not. There are many guest speakers who really help you understand the lives of people with disabilities and how common they are. The workload is a page paper each week. Its the best class.",
                    "14": "The class felt a little disorganized and you definitely get out what you put in",
                    "15": "The lectures go on and the professor sometimes goes off topic, overall a pretty easy course, the speakers brought in were very interesting",
                    "16": "Professor is great. He has guest lecturers come in every week and speak on their knowledge of disabilities. Super interesting but definitely an easy class (not in a bad way)",
                    "17": "very unclear instructions, however was a easy class in terms of workload",
                    "18": "Paul is awesome! The speakers he brought in were all advocates and allies of the disabled community which was interesting but I wish they were more varied. The readings and topics were easy to understand and applicable. Our grade was determined on the reflection papers due every week, which were super easy. Take this class if you can!",
                    "19": "The guest speakers were really important to me , hearing their stories really put things into perspective for me and I am really grateful to have taken this course.",
                    "20": "This was such a great class! Very easy A! The professor is amazing!",
                    "21": "This is a very easy course, there were not many assignments and it is easy to do well. You get let out around 8 every week. The class is interesting but a bit disorganized.",
                    "22": "This course has interesting readings and group speakers and is not challenging at all. Paul is very nice and is a funny Professor!",
                    "23": "This course was an easy A. The professor was very chill and the speakers were very interesting. I would take this if I was interested in learning about disability and want and easy A."
                },
                "school_demographics": {
                    "Weinberg": 3,
                    "McCormick": 1,
                    "Medill": 2,
                    "Comm": 26,
                    "SESP": 7,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 2,
                    "Sophomores": 11,
                    "Juniors": 13,
                    "Seniors": 13
                }
            }
        },
        "COMM_ST 352-0": {
            "2024 Spring": {
                "course_rating": {
                    "average": 4.85,
                    "student_count": 61
                },
                "student_opinions": {
                    "0": "Great course!",
                    "1": "The professor can be very annoying during class and kind of babies his students. Class is very easy, but if you want to actually learn about network analysis, don't take this class. Very basic level class – all code is given to you, simply analyzing graphs is the only work on the weekly labs.",
                    "2": "My dreamTeam allowed me to complete the project, but it did not create a dream team, so do not rely solely on that to create a good experience.",
                    "3": "the 3–hour lectures suck. The content is pretty interesting and Contractor is a great professor and lecturer. Though the attendance is pretty strict, lots of cold calling, you HAVE to sit through the 3–hour class most times and can't be late.",
                    "4": "Highly highly recommend taking this class! Nosh is probably one of the best professors on this campus and he makes the content super engaging. The coursework itself is not too demanding, but it definitely provides a new way to approach things. The class was long, but it's definitely worth taking!",
                    "5": "This course is very interesting and engaging at face value. I think I would have enjoyed the content more had the course been structured and taught in a different way. <br><br>The three hour lectures were difficult to maintain interest in the course throughout the week. I would have preferred two 1.5 hour courses. <br><br>Similarly, the Professor Contractor would often pace around the classroom in an effort to check that students had their name cards visible and take notes on what each student had displayed on their computer screen and engagement with the class.  As someone who has a hard time focusing for large periods of time, this discouraged me from utilizing resources that would've let me actively listen to class (i.e. playing 2048 to stimulate my brain every once in awhile, helping me focus on the lecture).  <br><br>I understand the need to ensure students are actively paying attention, but these lecturing methods of student engagement negatively impacted my experience. <br><br>i however, did really enjoy the pollev interactions in the class and would hope future versions of this class integrated them more.",
                    "6": "I learned about the ways to go about performing social network analysis on different types of networks in society.",
                    "7": "Did not like the class much. The content was not what I expected it to be. From a CS perspective do not really recommend taking",
                    "8": "Good class. Labs are interesting and final project is also very cool. Only bad thing is the fact that lectures are once a week and last for 3h... brutal",
                    "9": "I think the course was interactive and I enjoyed it. The class is really long since it's 3 hours though. The labs weren't bad and the TAs are great and really helpful.",
                    "10": "Contractor is very accomplished and intelligent, which left me a bit disappointed with the class. Maybe it's because I'm from a more technical background, but I felt that the interdisciplinary nature of the class sacrificed too many of the details that would have made it more interesting, making the 3 hour classes feel long. I left with many insights about social networks but I felt like the class would have benefitted from, instead of taking a broader and shallower view, focusing on a smaller component and diving deeper. However, the approach as it was was likely more practical and seeing the cutting–edge of the field was worthwhile.",
                    "11": "Just a really strange course. There isn't much motivation to learn the material as it is never really tested. The main assignments are the labs which tend to make little sense especially if you don't know R. You don't technically have to write any code but you do have to copy paste it around. Most of it boils down to looking at p values and coefficients and making conclusions about hypothesis. Prof is great but 3hr is a long time. Honestly my biggest gripe is the labs which just cover an enormous amount of content without much critical thinking. Not to mention a final project where you kind of do have to write code? But it has to be in R, kind of?",
                    "12": "This class was a great class. The work is very light, and you don't even need to know how to code in R. There was one three hour lecture per week, but they didn't even feel three hours long. The professor was really enthusiastic and the class activities were very engaging. The TAs also made themselves available if you needed help.",
                    "13": "One of (if not the best) the best classes I’ve taken at NU. If you can’t get in at first get on the waitlist. Nosh is the best professor I’ve had yet, and the material is truly so interesting. The DS/coding part is what you make of it, most of the coding isn’t too difficult/is provided for you, so you can really dive into understanding the theories behind the labs and classes.",
                    "14": "Learned a lot about social networking that I could see in my life as well, 5 labs that are pretty easy and a final group project throughout the quarter and weekly readings that take less than 30 mins.",
                    "15": "The professor is a big name in the field, and lecturing is very good even amongst people at this level. This class teaches you the frontier of SNA modeling and techniques by focusing more on the philosophy and motivation of these things. However, because there are no formal statistics &amp; CS prerequisites and the class lets you get away easily with most assignments without requiring you to actually understand it, working with teammates who don't pay attention to class content can be a PAIN in the ass.",
                    "16": "this class prepared me for my future fake email job",
                    "17": "I think this is a great course to take if you are interested. Though the description may indicate tedious work and hours spent modeling with code, it was the opposite. The labs which make up the bulk of coding in this class already have the necessary code provided and understanding and interpreting the results is most of the work.  The professors and TAs also did a great job of engaging the class with activities and real–life discussions. The only downside is the three hour length but there is plenty of breaks and take it with a couple of students you know",
                    "18": "Professor Contractor is an excellent instructor and storyteller who makes the 3–hour class so engaging. Although the content sometimes be very technical for comm student like me, but he is always able to make it interesting and meaningful through the real–life examples and in–class activities. The class significantly transforms the way I think about and approach the communication among people or in any kind of organizations. It makes me realize the importance and potential of social network analysis.",
                    "19": "Noshir is good at gauging students' feedback and keeping everyone engaged. However, I really think this class would be much better off being split into two lectures a week. 3 hours of continuous lectures will put anybody to sleep (I myself fallen asleep several times).  There were 5 assignments, all of which you were already provided the R code, and you mostly had to run the code and interpret the output. No exam. Final project is pretty open–ended and group–work.",
                    "20": "Interesting class, readings were a bit dense but Contractor was good at clarifying big picture ideas. Main thing is that although you use R, you don't have to code in R, which makes the final social network analysis project a bit difficult if you don't already have at least one person decent specifically at R. Also, for the final project, you have plenty of time, so it really just depends on getting good teammates who communicate. Otherwise, grading is pretty clear.",
                    "21": "This class is kinda strange. You don't actually have to learn anything. They give you all the code for the labs (they are quite still annoying though). The in–class polling questions are graded for completion, not accuracy. Lectures are interesting enough and you can basically do whatever you want on your computer during them –– basically study hall. Professor Contractor was nice at the beginning of the quarter, but was in some kind of bad mood by the end of the quarter and would call out students in front of the whole class for arriving a couple minutes late or for having their name plates displayed incorrectly – it was very uncomfortable.",
                    "22": "I thought this course was really interesting and it wasn't too hard. Always appreciate a project based class. 3 hour lectures are brutal though no matter what",
                    "23": "This course is among the most interesting and enjoyable courses that I've taken here and will teach you a good amount on how social network theory permeates our world. Prof. Contractor is extremely kind and eager to show us how our decisions are motivated by social networks. He has more than enough experience to back up his lectures. The labs are simple and were not much trouble as long as you start them on time, and for those unfamiliar with R it's not too big of a learning curve. As long as you attend lectures, understanding these concepts even with the math is not hard.",
                    "24": "Interesting content. Networks are everywhere!",
                    "25": "This class is incredibly interesting and they do their best to keep a 3 hour lecture very entertaining. However, the professor can pick on certain people and has a lot of rules around attendance/ being late to class. The material is very interesting though and you can tell Contractor is truly an expert on the subject",
                    "26": "Pretty chill class for CS Majors. Nothing too hard and you can put your final project on your resume which is always a plus.",
                    "27": "Decent class. not much coding for CS.",
                    "28": "The course topic is interesting and the professor really cares about feedback, which I think is great. Lectures can feel really long but the activities often help with this.",
                    "29": "Prof. Contractor is a very engaging and passionate professor. He knows so much about the topic and designed many very interesting and engaging activities in class (with the wonderful TAs!!!!) Very fun class.",
                    "30": "Overall, this course was great. I will intern at Meta this summer and took this course because I wanted to learn more about social networks applied to social media. Unfortunately, we didn't see anything related to social media, but I still learned a lot of useful concepts that can be applied more broadly!<br><br>Prof. Contractor is also very bright and I loved to interact with him. Somehow, he can engage students in a large lecture room – he even memorized all our names. However, the 3–hour time block seemed too long at times, and I found myself leaving class exhausted.",
                    "31": "Nosh is probably the most impressive professor I've had at Northwestern. Workload was fair and I thought the class was very interesting because of the instruction. I'd definitely recommend taking this for either the DS or MS.",
                    "32": "I loved the course. The TAs were very helpful, given that not a lot of people are familiar with statistics and everything, the course did a good job in including students from every domain and cater to their interests. The classes were very engaging and I never knew when the 3 hours went by.",
                    "33": "I enjoyed working on the final project. The degree of flexibility offered (with the entrepreneurial track) was great! Our team coded an app which allowed us to demonstrate our knowledge in a creative way.",
                    "34": "This class honestly has a lot of work. Labs and the final project are VERY time–consuming. Start early. Professor Contractor is awesome though!"
                },
                "school_demographics": {
                    "Weinberg": 16,
                    "McCormick": 33,
                    "Medill": 1,
                    "Comm": 9,
                    "SESP": 1,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 2,
                    "Sophomores": 19,
                    "Juniors": 33,
                    "Seniors": 4
                }
            }
        },
        "COMM_ST 352-SA": {
            "2024 Spring": {
                "course_rating": {
                    "average": 4.85,
                    "student_count": 61
                },
                "student_opinions": {
                    "0": "Great course!",
                    "1": "The professor can be very annoying during class and kind of babies his students. Class is very easy, but if you want to actually learn about network analysis, don't take this class. Very basic level class – all code is given to you, simply analyzing graphs is the only work on the weekly labs.",
                    "2": "My dreamTeam allowed me to complete the project, but it did not create a dream team, so do not rely solely on that to create a good experience.",
                    "3": "the 3–hour lectures suck. The content is pretty interesting and Contractor is a great professor and lecturer. Though the attendance is pretty strict, lots of cold calling, you HAVE to sit through the 3–hour class most times and can't be late.",
                    "4": "Highly highly recommend taking this class! Nosh is probably one of the best professors on this campus and he makes the content super engaging. The coursework itself is not too demanding, but it definitely provides a new way to approach things. The class was long, but it's definitely worth taking!",
                    "5": "This course is very interesting and engaging at face value. I think I would have enjoyed the content more had the course been structured and taught in a different way. <br><br>The three hour lectures were difficult to maintain interest in the course throughout the week. I would have preferred two 1.5 hour courses. <br><br>Similarly, the Professor Contractor would often pace around the classroom in an effort to check that students had their name cards visible and take notes on what each student had displayed on their computer screen and engagement with the class.  As someone who has a hard time focusing for large periods of time, this discouraged me from utilizing resources that would've let me actively listen to class (i.e. playing 2048 to stimulate my brain every once in awhile, helping me focus on the lecture).  <br><br>I understand the need to ensure students are actively paying attention, but these lecturing methods of student engagement negatively impacted my experience. <br><br>i however, did really enjoy the pollev interactions in the class and would hope future versions of this class integrated them more.",
                    "6": "I learned about the ways to go about performing social network analysis on different types of networks in society.",
                    "7": "Did not like the class much. The content was not what I expected it to be. From a CS perspective do not really recommend taking",
                    "8": "Good class. Labs are interesting and final project is also very cool. Only bad thing is the fact that lectures are once a week and last for 3h... brutal",
                    "9": "I think the course was interactive and I enjoyed it. The class is really long since it's 3 hours though. The labs weren't bad and the TAs are great and really helpful.",
                    "10": "Contractor is very accomplished and intelligent, which left me a bit disappointed with the class. Maybe it's because I'm from a more technical background, but I felt that the interdisciplinary nature of the class sacrificed too many of the details that would have made it more interesting, making the 3 hour classes feel long. I left with many insights about social networks but I felt like the class would have benefitted from, instead of taking a broader and shallower view, focusing on a smaller component and diving deeper. However, the approach as it was was likely more practical and seeing the cutting–edge of the field was worthwhile.",
                    "11": "Just a really strange course. There isn't much motivation to learn the material as it is never really tested. The main assignments are the labs which tend to make little sense especially if you don't know R. You don't technically have to write any code but you do have to copy paste it around. Most of it boils down to looking at p values and coefficients and making conclusions about hypothesis. Prof is great but 3hr is a long time. Honestly my biggest gripe is the labs which just cover an enormous amount of content without much critical thinking. Not to mention a final project where you kind of do have to write code? But it has to be in R, kind of?",
                    "12": "This class was a great class. The work is very light, and you don't even need to know how to code in R. There was one three hour lecture per week, but they didn't even feel three hours long. The professor was really enthusiastic and the class activities were very engaging. The TAs also made themselves available if you needed help.",
                    "13": "One of (if not the best) the best classes I’ve taken at NU. If you can’t get in at first get on the waitlist. Nosh is the best professor I’ve had yet, and the material is truly so interesting. The DS/coding part is what you make of it, most of the coding isn’t too difficult/is provided for you, so you can really dive into understanding the theories behind the labs and classes.",
                    "14": "Learned a lot about social networking that I could see in my life as well, 5 labs that are pretty easy and a final group project throughout the quarter and weekly readings that take less than 30 mins.",
                    "15": "The professor is a big name in the field, and lecturing is very good even amongst people at this level. This class teaches you the frontier of SNA modeling and techniques by focusing more on the philosophy and motivation of these things. However, because there are no formal statistics &amp; CS prerequisites and the class lets you get away easily with most assignments without requiring you to actually understand it, working with teammates who don't pay attention to class content can be a PAIN in the ass.",
                    "16": "this class prepared me for my future fake email job",
                    "17": "I think this is a great course to take if you are interested. Though the description may indicate tedious work and hours spent modeling with code, it was the opposite. The labs which make up the bulk of coding in this class already have the necessary code provided and understanding and interpreting the results is most of the work.  The professors and TAs also did a great job of engaging the class with activities and real–life discussions. The only downside is the three hour length but there is plenty of breaks and take it with a couple of students you know",
                    "18": "Professor Contractor is an excellent instructor and storyteller who makes the 3–hour class so engaging. Although the content sometimes be very technical for comm student like me, but he is always able to make it interesting and meaningful through the real–life examples and in–class activities. The class significantly transforms the way I think about and approach the communication among people or in any kind of organizations. It makes me realize the importance and potential of social network analysis.",
                    "19": "Noshir is good at gauging students' feedback and keeping everyone engaged. However, I really think this class would be much better off being split into two lectures a week. 3 hours of continuous lectures will put anybody to sleep (I myself fallen asleep several times).  There were 5 assignments, all of which you were already provided the R code, and you mostly had to run the code and interpret the output. No exam. Final project is pretty open–ended and group–work.",
                    "20": "Interesting class, readings were a bit dense but Contractor was good at clarifying big picture ideas. Main thing is that although you use R, you don't have to code in R, which makes the final social network analysis project a bit difficult if you don't already have at least one person decent specifically at R. Also, for the final project, you have plenty of time, so it really just depends on getting good teammates who communicate. Otherwise, grading is pretty clear.",
                    "21": "This class is kinda strange. You don't actually have to learn anything. They give you all the code for the labs (they are quite still annoying though). The in–class polling questions are graded for completion, not accuracy. Lectures are interesting enough and you can basically do whatever you want on your computer during them –– basically study hall. Professor Contractor was nice at the beginning of the quarter, but was in some kind of bad mood by the end of the quarter and would call out students in front of the whole class for arriving a couple minutes late or for having their name plates displayed incorrectly – it was very uncomfortable.",
                    "22": "I thought this course was really interesting and it wasn't too hard. Always appreciate a project based class. 3 hour lectures are brutal though no matter what",
                    "23": "This course is among the most interesting and enjoyable courses that I've taken here and will teach you a good amount on how social network theory permeates our world. Prof. Contractor is extremely kind and eager to show us how our decisions are motivated by social networks. He has more than enough experience to back up his lectures. The labs are simple and were not much trouble as long as you start them on time, and for those unfamiliar with R it's not too big of a learning curve. As long as you attend lectures, understanding these concepts even with the math is not hard.",
                    "24": "Interesting content. Networks are everywhere!",
                    "25": "This class is incredibly interesting and they do their best to keep a 3 hour lecture very entertaining. However, the professor can pick on certain people and has a lot of rules around attendance/ being late to class. The material is very interesting though and you can tell Contractor is truly an expert on the subject",
                    "26": "Pretty chill class for CS Majors. Nothing too hard and you can put your final project on your resume which is always a plus.",
                    "27": "Decent class. not much coding for CS.",
                    "28": "The course topic is interesting and the professor really cares about feedback, which I think is great. Lectures can feel really long but the activities often help with this.",
                    "29": "Prof. Contractor is a very engaging and passionate professor. He knows so much about the topic and designed many very interesting and engaging activities in class (with the wonderful TAs!!!!) Very fun class.",
                    "30": "Overall, this course was great. I will intern at Meta this summer and took this course because I wanted to learn more about social networks applied to social media. Unfortunately, we didn't see anything related to social media, but I still learned a lot of useful concepts that can be applied more broadly!<br><br>Prof. Contractor is also very bright and I loved to interact with him. Somehow, he can engage students in a large lecture room – he even memorized all our names. However, the 3–hour time block seemed too long at times, and I found myself leaving class exhausted.",
                    "31": "Nosh is probably the most impressive professor I've had at Northwestern. Workload was fair and I thought the class was very interesting because of the instruction. I'd definitely recommend taking this for either the DS or MS.",
                    "32": "I loved the course. The TAs were very helpful, given that not a lot of people are familiar with statistics and everything, the course did a good job in including students from every domain and cater to their interests. The classes were very engaging and I never knew when the 3 hours went by.",
                    "33": "I enjoyed working on the final project. The degree of flexibility offered (with the entrepreneurial track) was great! Our team coded an app which allowed us to demonstrate our knowledge in a creative way.",
                    "34": "This class honestly has a lot of work. Labs and the final project are VERY time–consuming. Start early. Professor Contractor is awesome though!"
                },
                "school_demographics": {
                    "Weinberg": 16,
                    "McCormick": 33,
                    "Medill": 1,
                    "Comm": 9,
                    "SESP": 1,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 2,
                    "Sophomores": 19,
                    "Juniors": 33,
                    "Seniors": 4
                }
            }
        },
        "COMM_ST 380-0": {
            "2024 Spring": {
                "course_rating": {
                    "average": 5.3,
                    "student_count": 20
                },
                "student_opinions": {
                    "0": "I highly recommend taking this course! I learned a lot about how political communication affects American democracy. It was super interesting and fun to hear everyone's opinions on different issues. The work was very manageable to keep up with – just make sure to start doing the documentary reflection essays early! Professor Nisbet is very educated on the topic, doing cool research on it, and keeps class really interesting through playing videos, asking for your opinion, and doing debates!",
                    "1": "Would highly recommend for anyone interested in Politics &amp; Communication! Very interesting topics, and the class debates are very engaging.",
                    "2": "This class is pretty straightforward. The material was interesting and Prof Nisbet is engaging. The class is heavily discussion based and he does cold call a lot so be prepared to speak.",
                    "3": "Good class, def recommend for a comm/poli sci student. Super low stress and Nisbet is chill and the workload is light",
                    "4": "This class was okay. I’m a political science major but I’m not all that interested in political communication. There are 5  documentary reflection papers 2–3 pages doubled spaced that you have to do, a debate/3 page position paper (low stakes), and a take home final exam 6–8 pages.",
                    "5": "Take this class! Professor Nisbet is a great and extremely engaging professor, the course content and lectures are actually very interesting and the workload isn't bad at all (5 reflection papers, final essay, and a short debate).",
                    "6": "There are 5 reflection essays (2–3 pages based on documentaries and readings), 1 debate + position paper (2–3pages), and a final paper (6–8 pages).  It is definitely a bit more work than some other communications classes, but essays are graded fairly and there is an extra credit essay opportunity.",
                    "7": "I thought this course was well–organized and the content was engaging. I value classes that make direct efforts to teach us and use multiple mediums to do it, and this class did that well.",
                    "8": "Everybody should take this class!!! It wasn't too much work but I learned so much. Professor Nisbet is so enthusiastic and knowledgeable and did a great job making this class engaging. I never wanted to skip class and was actually sad when it ended.",
                    "9": "Erik is a really great teacher with lots of experience and knowledge in the political comms field. He makes his lectures engaging by encouraging lots of participation, but it never feels like too much pressure or he's trying to catch you out in any way. Pretty light workload if you keep on top of things. 5 3 page response papers tying together documentaries and readings, one Oxford style 3 minute debate, attendance/particpiation, short final paper, extra credit.",
                    "10": "lectures were great! amazing and well planned and professor is always willing to help",
                    "11": "It was a great course! Super interesting material",
                    "12": "The class was very discussion based, so the readings eventually made sense.",
                    "13": "Dr Nisbet is clearly very enthusiastic about teaching this class! Grades are based on 5 (out of 12 possible) reflection papers, a debate/debate paper, and a final exam. Attendance is taken as well. Overall I enjoyed this class and would recommend taking it!",
                    "14": "LOVED this class!! It was super interesting, learning about political communication including its dangers, social media, political entertainment, humor, and campaigns. We had some really interesting speakers come in.  Super manageable as well because you have 5/12  3–page reflection papers, one debate, then the final exam. Prof Nisbet is very engaging and super nice.  Would recommend this course to anyone, esp for poli sci or comms majors."
                },
                "school_demographics": {
                    "Weinberg": 2,
                    "McCormick": 0,
                    "Medill": 1,
                    "Comm": 17,
                    "SESP": 1,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 1,
                    "Sophomores": 9,
                    "Juniors": 9,
                    "Seniors": 2
                }
            }
        },
        "COMM_ST 381-0": {
            "2024 Winter": {
                "course_rating": {
                    "average": 5.0,
                    "student_count": 22
                },
                "student_opinions": {
                    "0": "prof billard is actually goated! they clearly have a really good understanding of the course content and their lectures are are incredibly relevant (+ they;'re actually super funny and charismatic). we were mainly graded on one final paper 3000–5000 words long, but it was built up over the course of the quarter with one portion due every 2 weeks. TA Fatima left really constructive comments that helped you build your quarter. great class overall!!",
                    "1": "Good class",
                    "2": "This class was pretty interesting. I enjoyed getting to focus on one social movement throughout the quarter. I do wish that there were more assignments leading up to the final paper, however. I didn't feel entirely prepared for the final paper.",
                    "3": "The readings were really interesting but there were a few times I didn't do the readings but the professor explained everything so I didn't really feel behind. The final essay was a lot, especially since we hadn't turned in any other essay but it was really cool to write",
                    "4": "This course was very interesting, especially if you’re interested in social movements/politics. The class is great at generating interest in these subjects though!",
                    "5": "Prof. Billard is awesome and the course is definitely one of the most interesting I've taken. The readings/lectures can be theory dense, but a lot of the assignments are independent research based, so it's a good course to take if you enjoy this.",
                    "6": "I think that the class itself is not very engaging, but I like that we have worked all quarter on the final paper. I also like the freedom that the class has when picking your topics.",
                    "7": "The readings were interesting.",
                    "8": "The course is organized very clearly, there's a group case study presentation as well as some assignments spread throughout the quarter that are basically just different parts of the final paper. Workload is pretty consistent, and Professor Billard is a very clear and eloquent lecturer.",
                    "9": "The class is pretty interesting because of the social movement theories and choosing to write about a social movement. The class attendance dwindled throughout the quarter, and it was a lot of lecturing from the professor.  There is also a case study presentation and a lot of readings to keep up with.",
                    "10": "Amazing class and Professor Billard is so fun to work with! Highly recommand.",
                    "11": "This was an excellent class &amp; I highly recommend. Prof. Billard is super knowledgeable and chill and passionate about learning rather than grades –– the main part of the course is a final 12–page paper, but you build up to it throughout the quarter with opportunities to revise so you're basically guaranteed an A and have a lot of it written by the time you reach finals week. You get to choose any social movement you want to use as a case study for the final paper/duration of the course, and the class also provides a lot of interesting depth in terms of theory and application of the sociology of social movements. You have to do one presentation on a pre–selected class topic in random groupings, but they were all straightforward and interesting. If you need a soc credit or a related course credit, I'd definitely recommend taking this class (and attendance isn't required)."
                },
                "school_demographics": {
                    "Weinberg": 2,
                    "McCormick": 0,
                    "Medill": 1,
                    "Comm": 19,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 9,
                    "Juniors": 7,
                    "Seniors": 6
                }
            }
        },
        "COMM_ST 394-0": {
            "2024 Winter": {
                "course_rating": {
                    "average": 5.86,
                    "student_count": 14
                },
                "student_opinions": {
                    "0": "Professor Kalny is amazing. She is so passionate about teaching and education and cares so much about her students. The class was super manageable and engaging. I loved it",
                    "1": "Callie is legitimately the best professor I have EVER had at Northwestern. She is AMAZING. I actually cannot speak more highly of her. She is genuinely the most sweet, caring, and kind person ever. It is so clear how much she genuinely cared about each and every one of her students, both academically and personally. TAKE ANY CLASS YOU CAN WITH HER SHE IS AMAZING!!!! She was so quick to adjust anything we needed, and even brought in her dogs when we were all stressed. BEST PROF EVER EVER!!! Also, the class itself was super interesting. Overall 100/10 experience!",
                    "2": "Scaffolding the paper into weekly sections made the class very digestible.",
                    "3": "I loved this class! Callie is a fantastic instructor. She made the process of writing a research paper very feasible. If you are interested in research, definitely take this class!",
                    "4": "I wanted to use this course to prepare for my experience with the Communication Studies Department Honors Thesis — this could not have gone smoother. Callie is now a co–advisor on my project. I think this class has been my best academic experience at NU this far.",
                    "5": "This course was super interesting! It's a very niche topic, but it's super important to talk about given the current state of climate change rhetoric/opinion. I would highly recommend this class for anyone who's interested in climate change, persuasion, rhetoric, etc. It's also flexible, as we were able to write about a topic that we were drawn to. Callie is a very understanding person, which helped with focusing on improving my writing skills instead of worrying about getting a good grade. She was so helpful throughout the whole quarter.",
                    "6": "This course was absolutely phenomenal. Callie is one of the best teachers I have ever had the privilege of having at NU, and it is so evident how much she cares about her students and the topic at hand which was climate change persuasion. If you ever have the opportunity to take a class with Callie you have to. This course was daunting at first but became much more manageable after diving in. Every week we wrote a different section of our paper, so by the end of the quarter it was basically done which was super nice. Great class and super nice to write about something that you care about. Very easy to get a good grade if you put in effort.",
                    "7": "This class was cool because it helped me feel like a real research analyst. I liked the freedom with topics",
                    "8": "This was a fantastic class! I HIGHLY recommend taking this course (and any others offered) with Callie. She's an amazing professor who really cares about her students and seeks to cultivate an inclusive, intellectually curious classroom environment.  She broke our long research papers up into many different parts to ensure we could go in great detail into each section of an academic paper. Everything was engaging and all students left the class with an experience writing formal academic work. Great content, good pace, and a fantastic professor!",
                    "9": "I was so pleasantly surprised by this class!! Callie did an awesome job at breaking up a really daunting paper into manageable portions, and she was there with us every step of the way. She genuinely cared about all of us and wanted us to succeed. Her style of teaching made the class very informative yet simultaneously extremely enjoyable.",
                    "10": "TAKE THIS COURSE WITH KALNY!!! She’s so young yet so knowledgeable about everything. I’ve never felt more supported by a professor at northwestern. Her pedagogical approach to teaching is so conducive to her students needs!! She divides the paper up in a way that was so manageable. As someone who was scared to write a big paper, she made writing it so fun!! We got to choose our own topics so it made the writing process exciting. I can’t believe I wrote an entire research paper on something I was interested in!! Professors like Kalny are needed in academia!!",
                    "11": "This seminar was the absolute best. Callie is so helpful and eager to help in any way she can. She also is extremely flexible and wants to make sure you enjoy what you’re writing about."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 14,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 0,
                    "Juniors": 12,
                    "Seniors": 2
                }
            },
            "2024 Spring": {
                "course_rating": {
                    "average": 5.29,
                    "student_count": 24
                },
                "student_opinions": {
                    "0": "I wasn't super excited to take this class, but Professor Buchholz was such a pleasure to have. She was able to make the course interesting and engaging. She was very understanding as well. The coursework was not overwhelming or boring, but a good enough level of challenge to be stimulating. Class discussions were fun and well–guided. She makes speaking in class very comfortable.",
                    "1": "It was super fascinating and an amazing course. It was amazing to see each week's reading selections build on the prior ones and how it all made sense together.",
                    "2": "larissa is such great professor! shes super fun and always brings energy to the classes. you can really tell that she spent time to put together the syllabus and each classes' content and she also provides guides for homework each week. our class had pretty good vibes, and larissa facilitates a really open space for us to bring in examples from our own experiences and discuss concepts with one another. for assignments it was one reading memo per week, and several research proposal assignments that help you put together your final proposal at the end of the quarter. really easy, super chill!",
                    "3": "The readings were very interesting and I actually felt like I learned something from a comst class. The prof was very kind and helped us through the course and made sure that we were going to be well prepared for the final proposal at the end.",
                    "4": "Opted to take this course with Larissa specifically after having a lovely and fascinating class with her previously.  Really love her classes, her teaching style, etc. She assigns typically two readings (1 dense 1 not) per week that she gives a reading guide for, and you have a 150 word 200 max write up each week summarizing the readings' arguments and you ask and answer your own question at the end. Also in this class she assigns a reading per week about academic research methods. It is a very manageable workload. Other than the memos, there is a 7–8 page final paper which is a research proposal on a topic of your choice that she builds up to and very hands–on guides the whole quarter. Larissa is also just a great teacher and mentor, always willing to answer questions and brings in examples into her courses. Enourages SO MUCH conversation in the class and that really helps to solidify topics and readings. Highly recommend for the junior research seminar requirement.",
                    "5": "good course! larissa is a very nice professor and she clearly walks you through the entire process of writing a research proposal! the workload is very light (reading memo every week), and i like how larissa adapts each course session based on what we write in our memos (shows that she really reads through them when developing her lectures). it being a once a week 3 hr course made it a little hard to sit through sometimes, but larissa was very understanding and accommodating! (also, our final paper for this class is a lot shorter than one of the other comm research seminar classes, so that's a W) also, her dog amy is so cute!!",
                    "6": "The topic Prof Buccholtz teaches is super fun and fresh. The concept of creativity is one that was genuinely very fun to engage with in class. Also, it must be said that this professor is a gem. She brought us coffee, she brought in her dog, she's prioritizes group activities in class... she's awesome. You should DEFINITELY take your research seminar with her.",
                    "7": "Camille is fantastic! Really puts in the effort to get to know students and make class fun while we learn. Super receptive to student feedback, which is appreciated.",
                    "8": "Professor Saucier has a strong passion for the topic and is very knowledgeable! <br>She is the sweetest she came to my dance show T_T",
                    "9": "I thought the course was great, it is really set up to help you finish the final paper on time . Camille was also a very likable character and made class enjoyable.",
                    "10": "I'm pretty sure this course is gonna be discontinued but it was helpful to learn about research papers and how to write one. I'm glad I have a writing sample to submit if a job or scholarship requires.",
                    "11": "Camille is a super nice and understanding professor. The primary issue just lies with the course itself. The 20 page research paper feels like just fluff because there isn't really 20 pages worth of analysis to write about an advertisement. The class readings and activities also did not really build onto the paper. It felt like we were writing this paper independently and then having these in class assignments and out of class readings that weren't relevant.",
                    "12": "Take sticky messages with Camille!",
                    "13": "Facundo was amazing!! Super accommodating, interesting to listen to, and had a variety of activities that kept the class fresh and fun. I liked both the collaborative nature of the class as well as the different projects that we did along the way.",
                    "14": "This is a great course! It’s very interesting, and Facundo is a great teacher! You will learn a lot about sexuality in the digital age through different lenses, and then get to research a topic of your choice. The workload is not heavy either, if you pace yourself throughout the quarter. All in all I learned a lot, and really recommend this class!",
                    "15": "Super interesting topic and Facundo was great",
                    "16": "Professor Facundo is amazing!!! He is such a great professor – nice, funny and cares about his students. I was not really interested in sex–related studies prior to this class, but he was able to foster a lot of interest and make it really relevant. I realized how important this subject was and how intertwined it is in our daily lives. I recommend taking this class for your research seminar for sure! For the final research paper, we work on it throughout the quarter, focusing on meeting milestones such as a lit review, methods section, outline, that makes you really prepared once you get to finals. He offers a lot of feedback as well which is helpful!",
                    "17": "Facundo is a great prof and lovely person. All the topics were really interesting and I enjoyed getting to discuss them."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 15,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 1,
                    "Juniors": 14,
                    "Seniors": 0
                }
            },
            "2023 Fall": {
                "course_rating": {
                    "average": 5.33,
                    "student_count": 6
                },
                "student_opinions": {
                    "0": "The topics were really interesting and relevant so I thought it was interesting. Annika was super nice and really good at communicating so the course went by super smoothly. This is a requirement for comm students so eventually you'll have to take something like this but I suggest taking a class with Annika!",
                    "1": "Good opportunity to learn how to write research proposals and doing research. The step–by–step approach to writing the full research proposal helped a lot in terms of making improvements before the final submission. Lots of opportunities to get feedback from the instructor and classmates.",
                    "2": "This was a really amazing Seminar course, and I'm glad I took it! I especially liked the pacing of the course and how we built up to the 20+ pages gradually and with helpful feedback along the way. We covered each step of the research process, and the final topics individuals researched were all relevant and engaging.",
                    "3": "Class was engaging and insightful!",
                    "4": "This course was very well structured and was never too much work. She did a great job offering feedback and helping us learn."
                },
                "school_demographics": {
                    "Weinberg": 0,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 6,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 0,
                    "Juniors": 6,
                    "Seniors": 0
                }
            }
        },
        "COMM_ST 395-0": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.226129032258064,
                    "student_count": 31
                },
                "student_opinions": {
                    "0": "Only con of this class is we have no idea how grading will happen... currently at week 10 and yet got n/a% in our canvas",
                    "1": "It was set up to organize the big project/essay which I liked. <br>I will say that depending on your race/gender and make–up of the class you might feel like you have to remain silent on some issues and discussions.",
                    "2": "Professor Zidani is an incredible instructor and this class was one of my favorite Comm Studies classes I've taken in my 4 years here. Beyond having poignant insight on the topics covered in class, Prof. Zidani does an excellent job in highlighting the diverse intellectual strengths of every person in the class, giving them a balance of guidance and flexibility to draw out their individual interests. The format of the class was highly conducive to inspiring engaging discussions, and having student–led discussions of readings really raised the bar for the level of engagement that everyone has with the readings and with each other.",
                    "3": "This course really helped me understand and engage with the internet from a critical perspective, which is the entire point,  but the readings were genuinely interesting and engaged with everything from meme aesthetics to dating apps. Prof. Zidani is extremely competent, helpful, understanding, and the class is set up so that you can contribute to the week's conversation without being overwhelmed by information or extremely bored,",
                    "4": "I really loved taking this course! Zidani's lectures and student–facilitated discussions made for a really insightful learning environment. Class time went by pretty quickly, and I was really engaged when learning about various course topics.",
                    "5": "Really fun class that covered a lot of different subjects! There's a lot of interesting content in there and the workload is also manageable, it also helped that the readings were actually fun. A lot of open discussion was encouraged.",
                    "6": "Very fun and engaging class. The readings are very helpful and interesting. We designed our own interactive exhibit as the project of the course (for this one you can literally do anything you want as long as it's an interactive exhibit). Prof Long is super nice and helpful. She's very experienced in this field so she has a ton to say about all topics we discussed. You can also see her past design projects for lots of well–known museums as well. Really learned a lot. Strongly recommend",
                    "7": "love, love, loved this course! prob one of my favorite classes ive taken at northwestern (if not the favorite). I was already super interested in the coruse to begin with, but duri is such a great professor and i had so much fun engaging in discussions and hearing about her experiences in the field. weekly readings and discussion posts, 1 individual midterm assignment, and a final group project (inlcuding 2 milestones along the way). got to create a super fun final prototype and pitch deck!",
                    "8": "Interesting course, pretty easy class you just have weekly reading responses and one main project to do. Duri is really nice and easy to communicate with. If you're interested in museums of an easy class, take this",
                    "9": "this is such an interesting class, love the paper prototype and the exhibition analysis. Learnt a lot and also had so much fun ;–;",
                    "10": "The course focuses on principles of museum exhibit design grouped into different themes throughout the weeks and class periods. Throughout the weeks there are reading reflection assignments on the readings. The beginning of the course is focused on the Exhibit Analysis assignment which asks students to analyze and attend a museum exhibit in a paper format. Then there is an individuals Exhibit Design pitching project and then after this assignment students group to work on an Exhibit Design project during the remainder of the course. Throughout the group project on Exhibit Design there are various milestones, which have specific assignment parameters that are compiled into a final pitch deck.",
                    "11": "this course was pretty fun and chill. I liked how we could make our own exhibits also and we got to play with exhibits and watch videos in class",
                    "12": "The design project was really fun, also because you got to choose what you wanted to design and the group you wanted to design it with. And you got to see and interact wth other groups' designs! Super fun",
                    "13": "Definitely was interesting from a premed perspective. There are 2 10–12 page papers as the only real assignments. You are supposed to use AI to write the papers which is a bit harder than it sounds.",
                    "14": "This was a great class and was able to learn about a different perspective on chronic illness and healthcare. RECOMMEND ALL FUTURE DOCTORS TAKE THIS CLASS.",
                    "15": "Professor Lambert is fun to have. The course content was interesting and I really appreciated how he tried to get us to learn how to use AI. Take this class, you'll learn more than you think!",
                    "16": "For a three–hour lecture every week, I feel like most of class time was a waste of time –– either letting out super early or spending a big chunk of it watching documentaries. I feel like it would've been better if split up into multiple class periods per week. Prof. Lambert is also super big into AI and AI usage and will pressure you to use it in every assignment. Not my preference, but maybe others will enjoy it.",
                    "17": "There are so many better 3nn comm st courses...",
                    "18": "GREAT CLASS Prof. Lambert is so entertaining and actually made the 3 hour class go by really quickly. He is a very big AI proponent and basically forced us to learn how to use AI for our projects which was SO HELPFUL and such a great learning experience beyond the content of the course. Compared to other comms classes though, this class requires a lot of work. Hefty weekly readings and VERY LONG and time–consuming papers (2 of them, ~12 pages each). Other than the workload, I loved this class. You will do well if you are engaged and try.",
                    "19": "Really enjoyed the topic of this course. Professor was great. There was a midterm paper and final paper with discussion posts before and after each class. His grading wasn’t necessarily fair at times though.",
                    "20": "This course truly helped me understand some of the people in my life in terms of managing chronic illness. Of course it does not tell you everything about what it is to live with a chronic illness, since the only way to know that is to have one, but it does allows you to understand and consider some things we sometimes may take for granted.",
                    "21": "SO INTERESTING! Paper assignments were a LOT to handle when you had them, but besides that the class was very manageable and extremely engaging. Prof. Lambert is very knowledgable and is a great, fun speaker.",
                    "22": "This class was super interesting and relevant and was a good mix of lectures and videos. The big assignments give you lots of flexibility which is also really nice",
                    "23": "Professor Lambert is an interesting guy. The grading is based on reflection and warm up questions, and two 10–page papers."
                },
                "school_demographics": {
                    "Weinberg": 2,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 29,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 7,
                    "Juniors": 12,
                    "Seniors": 13
                }
            },
            "2024 Spring": {
                "course_rating": {
                    "average": 5.030923076923076,
                    "student_count": 65
                },
                "student_opinions": {
                    "0": "Great class, great professor, manageable workload. Highly recommend!",
                    "1": "Dr. Lu is such a great professor, it's hard to believe this is her first undergraduate course! She is very sweet and wants everyone to do well. She also took student feedback and really incorporated it into the course. If you're at all interested in digital propaganda, repression, and/or politics then I would highly recommend taking this course. It's graded based on participation, leading discussion one or two times, three quizzes, some small assignments, and a final project (which we work on throughout the quarter). The workload is not heavy at all, and the milestone workshops helped everyone stay on track and not procrastinate.",
                    "2": "This course was one of the overall best courses I’ve taken at Northwestern. It’s not a topic that originally piques interest, but what you learn in it is really important. It will help you expand your view of the world.",
                    "3": "Dr. Lu is great! The course was very interesting, and I feel like I learned a lot. There are a few open note quizzes, a panelist assignment, and a final project with a few milestones throughout the quarter. Nothing was too time consuming or stressful, and the course had a great structure to it that made the content very digestible. Would highly recommend!",
                    "4": "Professor is amazing, easy class, easy A, super responsible.",
                    "5": "Highly recommend this class! There is basically only 1 project that counts for most of your grade, and its divided up into different assignments for you to complete throughout the quarter so super manageable. Also 3 open note quizzes. A very easy A in my opinion. Dr Lu is very kind, helpful and understanding, although lectures can get a bit dry sometimes.",
                    "6": "This was a great class! Prof. Hendershot is so knowledgable, and I learned so much from her. Definitely not an easy class, though. Roughly 100+ pages of reading per week and the whole class is based on the readings. Aside from that, just 2 big assignments that you can tailor to your interests, so I enjoyed writing these essays. Overall, would totally recommend this class!",
                    "7": "Prof. Hendershot is a very enthusiastic, intelligent professor! They are very knowledge about media and American elections, so you're being taught by a great mind. This class had a lot of reading, but if you are interested in the topic, it is really revelatory about a lot of political history and relationship with the media. I came away having learnt a lot a lot of content– not sure where I'll apply all this historical content, but it is an interesting lens to consider for the future possibly.",
                    "8": "a lot of reading + seminar style discussion. 2 essays for the grade, that's it. they don't relate to course content directly which is both cool and also odd, the only time to demonstrate that you understood the readings was during the discussion. that being said it's a manageable workload and prof Hendershot is super knowledgeable and fun to talk to",
                    "9": "Take this class with Prof. Hendershot –– it was my favorite Medill class I've taken so far at NU. I did not have much background at all in U.S. elections/politics, but the readings assigned are very good at providing both the basic background and the more detailed material that we talk about in class. Each class, we focused on a specific election cycle; this organization was great because you can just focus on that time period for that week (with readings, etc.). The midterm and final papers were also open in scope enough that I learned a lot about topics that were interesting to me, rather than just writing generic papers. I would recommend going to office hours!",
                    "10": "Lecture can be extremely long, but there's a lot of learning. The discussion aspect of class is great, however there could be more videos/images during lecture to break up how long the discussion is. In addition, instead of reading about 100 pages each week, it'd be great if there was podcasts, videos, etc. incorporated in the required materials to be reviewed before each class.",
                    "11": "I loved the structure of this course (reading and learning the content then coming into class and having a discussion)",
                    "12": "If you are super interested in media and elections, then I would recommend this course! However the structure of class was difficult to stay engaged with, as our classes were once a week for 3 hours. In addition, the professor didn't use slides while teaching, so it was difficult to follow along as times. By the second half of the class, time sometimes felt like it was dragging along. To help, though, the professor did show us different presidential campaign advertisements through the years. I found this entertaining because we were able to shift our focus to visual evidence of campaigns over many decades. There are only two big assignments in this class: a midterm paper and a final paper. The grading can be a bit tough, but Prof. Hendershot is very thorough and provides great feedback. Overall, I enjoyed this course!",
                    "13": "Professor Irving is great at making the course fun and interesting. He does a mix of videos and discussion for the lecture part of class.",
                    "14": "The lectures are pretty decent its a lecture first then a student presentation we always leave 30 minutes early but sometimes its boring he is a nice guy but it get boring sometimes",
                    "15": "It was interesting and Prof. Rein had a lot of great stories! Discussions were engaging and was cool getting to see other students present on other topics of their choosing. Def would recommend, even as like a fifth class if you have the time!",
                    "16": "This class is really easy, but mostly group work which I hated. Lectures can be slow.",
                    "17": "Amazing class! Highly recommend",
                    "18": "This course was very interesting/engaging. However, I felt as though I had to study a lot for the weekly, 5 question quizzes because there was so much material that could possibly be one of the 5 questions. The weekly readings make up the quizzes, so if you want to succeed, you must do the readings. No final, but there is a midterm, which I also had to study a lot for. Would recommend though!",
                    "19": "This was the first year Lambert taught this class. He's a great professor and I could tell he was very passionate about this topic. There are weekly quizzes, a midterm, playlist project, and a group project at the end. The midterm covers a lot so it's a bit hard. The quizzes are doable if you do some of the readings and go over the lectures. It is possible to get an A, but you do have to try a bit. The projects are easy and fun.",
                    "20": "The prof is incredible, engaging lecture, manageable workload. 10/10 would recommend",
                    "21": "This course was amazing. I really appreciated how open everyone was and ready to learn. Professor Lambert is AMAZING! There was only 1 midterm and a few projects that were all very enjoyable. Great class",
                    "22": "This class was so useful in the real world. If you hypothetically want to take psychdellics, this class prepares you to in a safe, mediative way. The content is so interesting ranging from Bobb Jesse to the therapeutic effects of multiple psychdellics. The midterm is difficult, but fair. This is my favorite class I have ever taken at Northwestern.",
                    "23": "Fantastic class. Dr. Lambert is my favorite professor that I've had at this school. His lectures are consistently funny, entertaining, and well put together. Class discussions were always great, as the topic of psychedelics and consciousness is fascinating. I cannot recommend this class enough!",
                    "24": "Great class and well taught. You'll be very engaged in this class if you're interested in psychedelics. Pretty easy to get a good grade, but the midterm is really hard.",
                    "25": "The grading was way too harsh for this class, especially for projects. Do not recommend. Also the 70 question mditerm was very hard and asked very specific questions related to 100 page readings.",
                    "26": "Such an interesting class, super easy one of the best classes i have taken",
                    "27": "Professor Lambert is a great lecturer and you can tell by the way the course is set up that he is super knowledgeable. With that being said, he is not good with students and his midterm was a test of everything he said during the course, not something that challenged your understanding.",
                    "28": "First and foremost what makes this class incredible is the professor. He's wildly charismatic, intelligent, and and overall the type of person you would want to sit down and have lunch with –just to pick his brain.  The class is so much more than a \"psychedelics class\"–it's a class on the nature of consciousness, and how psychedelics provide a window into other forms of said consciousness. It touches on social revolutions, philosophy, mental illness and a host of other interesting and relevant topics. <br><br>The class will be interesting in spite of how little effort you put in (and it will be possible to put in little effort), although you will get way more out of it if you do some of the readings and pay attention. <br><br>One of the few classes I've taken at Northwestern that I actually felt was worth the money.",
                    "29": "I loved this class! Bruce is a great and engaging professor. I feel like I learned so much and was not overwhelmed by the amount of work. The readings were actually very interesting and it made me eager to come to class.",
                    "30": "Pretty easy course. I only took it because I was interested in psychedelics and wanted to learn a lot more about them which is what I think I was able to do in this class. It is not that hard of a class but definitely not an easy A either, an easy A– for sure. There is a lot of reading to do and it feels like a history class at times. There was one exam which was a 70 question MC. Overall pretty interesting if you have some extra time but makes you work more than you think.",
                    "31": "This course had the potential to be one of the best courses I took at Northwestern, however some of the specifics of the course made me dislike it more and more over the course of the quarter. The content itself was interesting and remained so throughout the course, however after the midterm, I felt extremely discouraged and not willing to put in as much effort. The midterm was a 60 question multiple choice straight memorization test, which I did not feel tested any of the important content of the course or a reflection of what I had learned. My performance on the midterm set my grade back tremendously in the class, and while I ultimately finished with an A, it was very difficult to do so and not an accurate reflection of the effort that I put in.",
                    "32": "It's a pretty easy and fun class the assignments  are quizzes every week and a midterm(study for this the average was pretty low) and there's also other easy and pretty fun assignments",
                    "33": "We had weekly quizzes and 3 projects and 1 midterm. The midterm was very difficult even though I studied a lot for it. The 3 assignments were pretty cool, one was a group project which I was worried about but it was totally fine. The material is really interesting and overall was a fun class.",
                    "34": "Bruce is great and an amazing professor! You will definitely enjoy this class highly recommend. Some long readings though with quizzes but definitely doable with effort",
                    "35": "Extremely detailed and careful over students well–being. He made the class feel very comfortable in sharing personal stories.",
                    "36": "It was interesting at times but a bit less fun than you would expect given the topic was Psychedelics.",
                    "37": "Loved this class Sarah is the best and is very understanding of everything not only is it an easy class and you'll get an A but it is really an awesome class",
                    "38": "Sarah is a great professor who is so knowledgable and kind! She knows her stuff and brings her background in mental health work to this course. Lots of reflection–based assignments and a large project where you pitch/invent a technology to promote mental health. Not very time intensive but lots of discussions in class and an overall great class. Easy to do well with Sarah's support and certainly helps you think about your engagement with technology and how it impacts your daily life.",
                    "39": "Overall, the course was great, but I wish we could discuss more than surface level. Perhaps the topics can be more narrow.",
                    "40": "Great course, good content and amazing professor!",
                    "41": "Love Sarah!! This social media class was so fun!! Most of the assignments are reflection based, and Sarah lets us reflect on readings/listening assignments through video instead of writing a paper. I loved learning about social media and its impacts on mental health, relationships, etc. take this class!! You will get an A as long as you do the work!!",
                    "42": "Amazing class!! Sarah is the absolute best, and this is a great low–stress comm class. I loved the option to do video responses instead of papers, and the classes were super engaging and relevant.",
                    "43": "It was very dialogue heavy, and prof Syversen is incredibly warm and understanding."
                },
                "school_demographics": {
                    "Weinberg": 12,
                    "McCormick": 3,
                    "Medill": 4,
                    "Comm": 43,
                    "SESP": 0,
                    "Bienen": 1
                },
                "class_demographics": {
                    "Freshmen": 5,
                    "Sophomores": 17,
                    "Juniors": 34,
                    "Seniors": 8
                }
            },
            "2024 Winter": {
                "course_rating": {
                    "average": 4.4184210526315795,
                    "student_count": 19
                },
                "student_opinions": {
                    "0": "This class was definitely hard BUT SO WORTH IT. Professor Immer and Shaw are both incredible and work with each other so well. The teaching staff expects a lot from the students but I got so much out of it. This is the best class I have taken at Northwestern.",
                    "1": "This course was excellent! Each lecture was thoroughly engaging, placing students in a new historical context and discussing the spread of information at that time. I was pleasantly surprised by how much I learned from both the readings and lectures in this course––every theoretical concept could be applied to today's technology somehow and that was very satisfying. If you are at all interested in the way communication has evolved over the past few centuries, I would highly recommend taking this course. It will grant you a unique perspective for thinking about the modern world of social media and artificial intelligence.",
                    "2": "I loved this course! Love Immer and Shaw and the teaching team was really involved and engaged with students.",
                    "3": "The course was really interesting. I learned a lot about information that I didn't expect to be widely applicable, but ended up being so.",
                    "4": "This is a great course if you want to learn about how to effectively visualize different data sets. It allowed me to understand the different types of data and explore different ways to visualize it. I really enjoyed this course",
                    "5": "if you don't use R and Shiny don't take it lol professor doesn't teach you anything about code which makes final project so tricky",
                    "6": "This is an okay class. You do have to do some coding in r, and although I got by with no experience in it you will definitely be at an advantage if you have done some of it before. The final is a group project where you have to code an article which is hard to work with and coordinate with people. Each week, one class is a lecture and the other is a lab where you do more hands on stuff which is nice because you get assignments done and learn things by doing.",
                    "7": "The first half of the quarter consists of weekly labs based on R Studio platform. As someone with very little coding experience (had only taken Comp Sci 110), I found it very difficult and didn't even know what questions to ask. I enjoyed learning about the design principles and there are great information visualization examples in class, but crafting them was quite challenging.",
                    "8": "i liked this course and i think professor kay was a nice and chill prof! i liked that the group project had multiple stages in progress to submit so that you wouldn't do everything all at once at the end of the quarter, and there were no other major assignments aside from that. i'd just advise that you make sure your group doesn't slack off and that everyone contributes somewhat equally. info viz is a very interesting topic to learn more about!",
                    "9": "I thought this course was super well–structured and taught me a lot in terms of creating and analyzing different visualizations! The coding wasn't too hard (as someone who isn't familiar with R) and Professor Kay is great!!",
                    "10": "If you aren't interested or don't see yourself creating graphs, charts, and visualizations in the future don't take this class.",
                    "11": "Great introduction to data visualization and coding in R! I had no coding experience going in, but honestly didn't have much trouble with it because it was  presented in a super great tutorial style which was easy to follow. This class requires work, but not overkill, and it is super interesting and rewarding. Fair warning that like half the class is completed with a project group...would advise to sign up with friends. I went in alone and ended up having a really great group, but honestly it could have been bad if I had a bad group."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 17,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 3,
                    "Juniors": 10,
                    "Seniors": 4
                }
            }
        },
        "COMM_ST 395-SA": {
            "2023 Fall": {
                "course_rating": {
                    "average": 5.226129032258064,
                    "student_count": 31
                },
                "student_opinions": {
                    "0": "Only con of this class is we have no idea how grading will happen... currently at week 10 and yet got n/a% in our canvas",
                    "1": "It was set up to organize the big project/essay which I liked. <br>I will say that depending on your race/gender and make–up of the class you might feel like you have to remain silent on some issues and discussions.",
                    "2": "Professor Zidani is an incredible instructor and this class was one of my favorite Comm Studies classes I've taken in my 4 years here. Beyond having poignant insight on the topics covered in class, Prof. Zidani does an excellent job in highlighting the diverse intellectual strengths of every person in the class, giving them a balance of guidance and flexibility to draw out their individual interests. The format of the class was highly conducive to inspiring engaging discussions, and having student–led discussions of readings really raised the bar for the level of engagement that everyone has with the readings and with each other.",
                    "3": "This course really helped me understand and engage with the internet from a critical perspective, which is the entire point,  but the readings were genuinely interesting and engaged with everything from meme aesthetics to dating apps. Prof. Zidani is extremely competent, helpful, understanding, and the class is set up so that you can contribute to the week's conversation without being overwhelmed by information or extremely bored,",
                    "4": "I really loved taking this course! Zidani's lectures and student–facilitated discussions made for a really insightful learning environment. Class time went by pretty quickly, and I was really engaged when learning about various course topics.",
                    "5": "Really fun class that covered a lot of different subjects! There's a lot of interesting content in there and the workload is also manageable, it also helped that the readings were actually fun. A lot of open discussion was encouraged.",
                    "6": "Very fun and engaging class. The readings are very helpful and interesting. We designed our own interactive exhibit as the project of the course (for this one you can literally do anything you want as long as it's an interactive exhibit). Prof Long is super nice and helpful. She's very experienced in this field so she has a ton to say about all topics we discussed. You can also see her past design projects for lots of well–known museums as well. Really learned a lot. Strongly recommend",
                    "7": "love, love, loved this course! prob one of my favorite classes ive taken at northwestern (if not the favorite). I was already super interested in the coruse to begin with, but duri is such a great professor and i had so much fun engaging in discussions and hearing about her experiences in the field. weekly readings and discussion posts, 1 individual midterm assignment, and a final group project (inlcuding 2 milestones along the way). got to create a super fun final prototype and pitch deck!",
                    "8": "Interesting course, pretty easy class you just have weekly reading responses and one main project to do. Duri is really nice and easy to communicate with. If you're interested in museums of an easy class, take this",
                    "9": "this is such an interesting class, love the paper prototype and the exhibition analysis. Learnt a lot and also had so much fun ;–;",
                    "10": "The course focuses on principles of museum exhibit design grouped into different themes throughout the weeks and class periods. Throughout the weeks there are reading reflection assignments on the readings. The beginning of the course is focused on the Exhibit Analysis assignment which asks students to analyze and attend a museum exhibit in a paper format. Then there is an individuals Exhibit Design pitching project and then after this assignment students group to work on an Exhibit Design project during the remainder of the course. Throughout the group project on Exhibit Design there are various milestones, which have specific assignment parameters that are compiled into a final pitch deck.",
                    "11": "this course was pretty fun and chill. I liked how we could make our own exhibits also and we got to play with exhibits and watch videos in class",
                    "12": "The design project was really fun, also because you got to choose what you wanted to design and the group you wanted to design it with. And you got to see and interact wth other groups' designs! Super fun",
                    "13": "Definitely was interesting from a premed perspective. There are 2 10–12 page papers as the only real assignments. You are supposed to use AI to write the papers which is a bit harder than it sounds.",
                    "14": "This was a great class and was able to learn about a different perspective on chronic illness and healthcare. RECOMMEND ALL FUTURE DOCTORS TAKE THIS CLASS.",
                    "15": "Professor Lambert is fun to have. The course content was interesting and I really appreciated how he tried to get us to learn how to use AI. Take this class, you'll learn more than you think!",
                    "16": "For a three–hour lecture every week, I feel like most of class time was a waste of time –– either letting out super early or spending a big chunk of it watching documentaries. I feel like it would've been better if split up into multiple class periods per week. Prof. Lambert is also super big into AI and AI usage and will pressure you to use it in every assignment. Not my preference, but maybe others will enjoy it.",
                    "17": "There are so many better 3nn comm st courses...",
                    "18": "GREAT CLASS Prof. Lambert is so entertaining and actually made the 3 hour class go by really quickly. He is a very big AI proponent and basically forced us to learn how to use AI for our projects which was SO HELPFUL and such a great learning experience beyond the content of the course. Compared to other comms classes though, this class requires a lot of work. Hefty weekly readings and VERY LONG and time–consuming papers (2 of them, ~12 pages each). Other than the workload, I loved this class. You will do well if you are engaged and try.",
                    "19": "Really enjoyed the topic of this course. Professor was great. There was a midterm paper and final paper with discussion posts before and after each class. His grading wasn’t necessarily fair at times though.",
                    "20": "This course truly helped me understand some of the people in my life in terms of managing chronic illness. Of course it does not tell you everything about what it is to live with a chronic illness, since the only way to know that is to have one, but it does allows you to understand and consider some things we sometimes may take for granted.",
                    "21": "SO INTERESTING! Paper assignments were a LOT to handle when you had them, but besides that the class was very manageable and extremely engaging. Prof. Lambert is very knowledgable and is a great, fun speaker.",
                    "22": "This class was super interesting and relevant and was a good mix of lectures and videos. The big assignments give you lots of flexibility which is also really nice",
                    "23": "Professor Lambert is an interesting guy. The grading is based on reflection and warm up questions, and two 10–page papers."
                },
                "school_demographics": {
                    "Weinberg": 2,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 29,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 7,
                    "Juniors": 12,
                    "Seniors": 13
                }
            },
            "2024 Spring": {
                "course_rating": {
                    "average": 5.030923076923076,
                    "student_count": 65
                },
                "student_opinions": {
                    "0": "Great class, great professor, manageable workload. Highly recommend!",
                    "1": "Dr. Lu is such a great professor, it's hard to believe this is her first undergraduate course! She is very sweet and wants everyone to do well. She also took student feedback and really incorporated it into the course. If you're at all interested in digital propaganda, repression, and/or politics then I would highly recommend taking this course. It's graded based on participation, leading discussion one or two times, three quizzes, some small assignments, and a final project (which we work on throughout the quarter). The workload is not heavy at all, and the milestone workshops helped everyone stay on track and not procrastinate.",
                    "2": "This course was one of the overall best courses I’ve taken at Northwestern. It’s not a topic that originally piques interest, but what you learn in it is really important. It will help you expand your view of the world.",
                    "3": "Dr. Lu is great! The course was very interesting, and I feel like I learned a lot. There are a few open note quizzes, a panelist assignment, and a final project with a few milestones throughout the quarter. Nothing was too time consuming or stressful, and the course had a great structure to it that made the content very digestible. Would highly recommend!",
                    "4": "Professor is amazing, easy class, easy A, super responsible.",
                    "5": "Highly recommend this class! There is basically only 1 project that counts for most of your grade, and its divided up into different assignments for you to complete throughout the quarter so super manageable. Also 3 open note quizzes. A very easy A in my opinion. Dr Lu is very kind, helpful and understanding, although lectures can get a bit dry sometimes.",
                    "6": "This was a great class! Prof. Hendershot is so knowledgable, and I learned so much from her. Definitely not an easy class, though. Roughly 100+ pages of reading per week and the whole class is based on the readings. Aside from that, just 2 big assignments that you can tailor to your interests, so I enjoyed writing these essays. Overall, would totally recommend this class!",
                    "7": "Prof. Hendershot is a very enthusiastic, intelligent professor! They are very knowledge about media and American elections, so you're being taught by a great mind. This class had a lot of reading, but if you are interested in the topic, it is really revelatory about a lot of political history and relationship with the media. I came away having learnt a lot a lot of content– not sure where I'll apply all this historical content, but it is an interesting lens to consider for the future possibly.",
                    "8": "a lot of reading + seminar style discussion. 2 essays for the grade, that's it. they don't relate to course content directly which is both cool and also odd, the only time to demonstrate that you understood the readings was during the discussion. that being said it's a manageable workload and prof Hendershot is super knowledgeable and fun to talk to",
                    "9": "Take this class with Prof. Hendershot –– it was my favorite Medill class I've taken so far at NU. I did not have much background at all in U.S. elections/politics, but the readings assigned are very good at providing both the basic background and the more detailed material that we talk about in class. Each class, we focused on a specific election cycle; this organization was great because you can just focus on that time period for that week (with readings, etc.). The midterm and final papers were also open in scope enough that I learned a lot about topics that were interesting to me, rather than just writing generic papers. I would recommend going to office hours!",
                    "10": "Lecture can be extremely long, but there's a lot of learning. The discussion aspect of class is great, however there could be more videos/images during lecture to break up how long the discussion is. In addition, instead of reading about 100 pages each week, it'd be great if there was podcasts, videos, etc. incorporated in the required materials to be reviewed before each class.",
                    "11": "I loved the structure of this course (reading and learning the content then coming into class and having a discussion)",
                    "12": "If you are super interested in media and elections, then I would recommend this course! However the structure of class was difficult to stay engaged with, as our classes were once a week for 3 hours. In addition, the professor didn't use slides while teaching, so it was difficult to follow along as times. By the second half of the class, time sometimes felt like it was dragging along. To help, though, the professor did show us different presidential campaign advertisements through the years. I found this entertaining because we were able to shift our focus to visual evidence of campaigns over many decades. There are only two big assignments in this class: a midterm paper and a final paper. The grading can be a bit tough, but Prof. Hendershot is very thorough and provides great feedback. Overall, I enjoyed this course!",
                    "13": "Professor Irving is great at making the course fun and interesting. He does a mix of videos and discussion for the lecture part of class.",
                    "14": "The lectures are pretty decent its a lecture first then a student presentation we always leave 30 minutes early but sometimes its boring he is a nice guy but it get boring sometimes",
                    "15": "It was interesting and Prof. Rein had a lot of great stories! Discussions were engaging and was cool getting to see other students present on other topics of their choosing. Def would recommend, even as like a fifth class if you have the time!",
                    "16": "This class is really easy, but mostly group work which I hated. Lectures can be slow.",
                    "17": "Amazing class! Highly recommend",
                    "18": "This course was very interesting/engaging. However, I felt as though I had to study a lot for the weekly, 5 question quizzes because there was so much material that could possibly be one of the 5 questions. The weekly readings make up the quizzes, so if you want to succeed, you must do the readings. No final, but there is a midterm, which I also had to study a lot for. Would recommend though!",
                    "19": "This was the first year Lambert taught this class. He's a great professor and I could tell he was very passionate about this topic. There are weekly quizzes, a midterm, playlist project, and a group project at the end. The midterm covers a lot so it's a bit hard. The quizzes are doable if you do some of the readings and go over the lectures. It is possible to get an A, but you do have to try a bit. The projects are easy and fun.",
                    "20": "The prof is incredible, engaging lecture, manageable workload. 10/10 would recommend",
                    "21": "This course was amazing. I really appreciated how open everyone was and ready to learn. Professor Lambert is AMAZING! There was only 1 midterm and a few projects that were all very enjoyable. Great class",
                    "22": "This class was so useful in the real world. If you hypothetically want to take psychdellics, this class prepares you to in a safe, mediative way. The content is so interesting ranging from Bobb Jesse to the therapeutic effects of multiple psychdellics. The midterm is difficult, but fair. This is my favorite class I have ever taken at Northwestern.",
                    "23": "Fantastic class. Dr. Lambert is my favorite professor that I've had at this school. His lectures are consistently funny, entertaining, and well put together. Class discussions were always great, as the topic of psychedelics and consciousness is fascinating. I cannot recommend this class enough!",
                    "24": "Great class and well taught. You'll be very engaged in this class if you're interested in psychedelics. Pretty easy to get a good grade, but the midterm is really hard.",
                    "25": "The grading was way too harsh for this class, especially for projects. Do not recommend. Also the 70 question mditerm was very hard and asked very specific questions related to 100 page readings.",
                    "26": "Such an interesting class, super easy one of the best classes i have taken",
                    "27": "Professor Lambert is a great lecturer and you can tell by the way the course is set up that he is super knowledgeable. With that being said, he is not good with students and his midterm was a test of everything he said during the course, not something that challenged your understanding.",
                    "28": "First and foremost what makes this class incredible is the professor. He's wildly charismatic, intelligent, and and overall the type of person you would want to sit down and have lunch with –just to pick his brain.  The class is so much more than a \"psychedelics class\"–it's a class on the nature of consciousness, and how psychedelics provide a window into other forms of said consciousness. It touches on social revolutions, philosophy, mental illness and a host of other interesting and relevant topics. <br><br>The class will be interesting in spite of how little effort you put in (and it will be possible to put in little effort), although you will get way more out of it if you do some of the readings and pay attention. <br><br>One of the few classes I've taken at Northwestern that I actually felt was worth the money.",
                    "29": "I loved this class! Bruce is a great and engaging professor. I feel like I learned so much and was not overwhelmed by the amount of work. The readings were actually very interesting and it made me eager to come to class.",
                    "30": "Pretty easy course. I only took it because I was interested in psychedelics and wanted to learn a lot more about them which is what I think I was able to do in this class. It is not that hard of a class but definitely not an easy A either, an easy A– for sure. There is a lot of reading to do and it feels like a history class at times. There was one exam which was a 70 question MC. Overall pretty interesting if you have some extra time but makes you work more than you think.",
                    "31": "This course had the potential to be one of the best courses I took at Northwestern, however some of the specifics of the course made me dislike it more and more over the course of the quarter. The content itself was interesting and remained so throughout the course, however after the midterm, I felt extremely discouraged and not willing to put in as much effort. The midterm was a 60 question multiple choice straight memorization test, which I did not feel tested any of the important content of the course or a reflection of what I had learned. My performance on the midterm set my grade back tremendously in the class, and while I ultimately finished with an A, it was very difficult to do so and not an accurate reflection of the effort that I put in.",
                    "32": "It's a pretty easy and fun class the assignments  are quizzes every week and a midterm(study for this the average was pretty low) and there's also other easy and pretty fun assignments",
                    "33": "We had weekly quizzes and 3 projects and 1 midterm. The midterm was very difficult even though I studied a lot for it. The 3 assignments were pretty cool, one was a group project which I was worried about but it was totally fine. The material is really interesting and overall was a fun class.",
                    "34": "Bruce is great and an amazing professor! You will definitely enjoy this class highly recommend. Some long readings though with quizzes but definitely doable with effort",
                    "35": "Extremely detailed and careful over students well–being. He made the class feel very comfortable in sharing personal stories.",
                    "36": "It was interesting at times but a bit less fun than you would expect given the topic was Psychedelics.",
                    "37": "Loved this class Sarah is the best and is very understanding of everything not only is it an easy class and you'll get an A but it is really an awesome class",
                    "38": "Sarah is a great professor who is so knowledgable and kind! She knows her stuff and brings her background in mental health work to this course. Lots of reflection–based assignments and a large project where you pitch/invent a technology to promote mental health. Not very time intensive but lots of discussions in class and an overall great class. Easy to do well with Sarah's support and certainly helps you think about your engagement with technology and how it impacts your daily life.",
                    "39": "Overall, the course was great, but I wish we could discuss more than surface level. Perhaps the topics can be more narrow.",
                    "40": "Great course, good content and amazing professor!",
                    "41": "Love Sarah!! This social media class was so fun!! Most of the assignments are reflection based, and Sarah lets us reflect on readings/listening assignments through video instead of writing a paper. I loved learning about social media and its impacts on mental health, relationships, etc. take this class!! You will get an A as long as you do the work!!",
                    "42": "Amazing class!! Sarah is the absolute best, and this is a great low–stress comm class. I loved the option to do video responses instead of papers, and the classes were super engaging and relevant.",
                    "43": "It was very dialogue heavy, and prof Syversen is incredibly warm and understanding."
                },
                "school_demographics": {
                    "Weinberg": 12,
                    "McCormick": 3,
                    "Medill": 4,
                    "Comm": 43,
                    "SESP": 0,
                    "Bienen": 1
                },
                "class_demographics": {
                    "Freshmen": 5,
                    "Sophomores": 17,
                    "Juniors": 34,
                    "Seniors": 8
                }
            },
            "2024 Winter": {
                "course_rating": {
                    "average": 4.4184210526315795,
                    "student_count": 19
                },
                "student_opinions": {
                    "0": "This class was definitely hard BUT SO WORTH IT. Professor Immer and Shaw are both incredible and work with each other so well. The teaching staff expects a lot from the students but I got so much out of it. This is the best class I have taken at Northwestern.",
                    "1": "This course was excellent! Each lecture was thoroughly engaging, placing students in a new historical context and discussing the spread of information at that time. I was pleasantly surprised by how much I learned from both the readings and lectures in this course––every theoretical concept could be applied to today's technology somehow and that was very satisfying. If you are at all interested in the way communication has evolved over the past few centuries, I would highly recommend taking this course. It will grant you a unique perspective for thinking about the modern world of social media and artificial intelligence.",
                    "2": "I loved this course! Love Immer and Shaw and the teaching team was really involved and engaged with students.",
                    "3": "The course was really interesting. I learned a lot about information that I didn't expect to be widely applicable, but ended up being so.",
                    "4": "This is a great course if you want to learn about how to effectively visualize different data sets. It allowed me to understand the different types of data and explore different ways to visualize it. I really enjoyed this course",
                    "5": "if you don't use R and Shiny don't take it lol professor doesn't teach you anything about code which makes final project so tricky",
                    "6": "This is an okay class. You do have to do some coding in r, and although I got by with no experience in it you will definitely be at an advantage if you have done some of it before. The final is a group project where you have to code an article which is hard to work with and coordinate with people. Each week, one class is a lecture and the other is a lab where you do more hands on stuff which is nice because you get assignments done and learn things by doing.",
                    "7": "The first half of the quarter consists of weekly labs based on R Studio platform. As someone with very little coding experience (had only taken Comp Sci 110), I found it very difficult and didn't even know what questions to ask. I enjoyed learning about the design principles and there are great information visualization examples in class, but crafting them was quite challenging.",
                    "8": "i liked this course and i think professor kay was a nice and chill prof! i liked that the group project had multiple stages in progress to submit so that you wouldn't do everything all at once at the end of the quarter, and there were no other major assignments aside from that. i'd just advise that you make sure your group doesn't slack off and that everyone contributes somewhat equally. info viz is a very interesting topic to learn more about!",
                    "9": "I thought this course was super well–structured and taught me a lot in terms of creating and analyzing different visualizations! The coding wasn't too hard (as someone who isn't familiar with R) and Professor Kay is great!!",
                    "10": "If you aren't interested or don't see yourself creating graphs, charts, and visualizations in the future don't take this class.",
                    "11": "Great introduction to data visualization and coding in R! I had no coding experience going in, but honestly didn't have much trouble with it because it was  presented in a super great tutorial style which was easy to follow. This class requires work, but not overkill, and it is super interesting and rewarding. Fair warning that like half the class is completed with a project group...would advise to sign up with friends. I went in alone and ended up having a really great group, but honestly it could have been bad if I had a bad group."
                },
                "school_demographics": {
                    "Weinberg": 1,
                    "McCormick": 0,
                    "Medill": 0,
                    "Comm": 17,
                    "SESP": 0,
                    "Bienen": 0
                },
                "class_demographics": {
                    "Freshmen": 0,
                    "Sophomores": 3,
                    "Juniors": 10,
                    "Seniors": 4
                }
            }
        }
    }
}